<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
</head>

<body>
<p align="center"><strong>CH&#431;&#416;NG 5:</strong> <br />
    <strong>C&Agrave;I &#272;&#7862;T, &#272;&Aacute;NH GI&Aacute; K&#7870;T QU&#7842; </strong><br />
    <strong>V&Agrave; H&#431;&#7898;NG PH&Aacute;T TRI&#7874;N</strong><br />
    </p>
<p align="left"><strong>N&#7897;i dung: </strong></p>
<blockquote>
  <p align="left"><strong><a href="#5.1">M&ocirc;i tr&#432;&#7901;ng c&agrave;i &#273;&#7863;t</a></strong></p>
  <p align="left"><strong><a href="#5.2">&#272;&aacute;nh gi&aacute; k&#7871;t qu&#7843;</a></strong></p>
  <p align="left"><strong><a href="#5.3">H&#432;&#7899;ng ph&aacute;t tri&#7875;n</a></strong></p>
</blockquote>
<p align="left">&nbsp;</p>
<p align="left"><strong><A NAME = "5.1">5.1</A>. M&ocirc;i tr&#432;&#7901;ng c&agrave;i &#273;&#7863;t</strong><br />
  Vi&#7879;c l&#7921;a ch&#7885;n  c&ocirc;ng ngh&#7879; sao cho ph&ugrave; h&#7907;p v&#7899;i &#7913;ng d&#7909;ng mu&#7889;n ph&aacute;t tri&#7875;n l&agrave; &#273;i&#7873;u quan tr&#7885;ng. V&#7899;i  s&#7921; ph&aacute;t tri&#7875;n c&#7911;a c&ocirc;ng ngh&#7879; th&ocirc;ng tin nh&#432; hi&#7879;n nay, nhi&#7873;u c&ocirc;ng ngh&#7879; m&#7899;i ra &#273;&#7901;i,  xu&#7845;t hi&#7879;n nhi&#7873;u ng&ocirc;n ng&#7919; m&#7899;i &#273;&#7875; &#273;&aacute;p &#7913;ng cho nhi&#7873;u nhu c&#7847;u kh&aacute;c nhau thu&#7897;c c&aacute;c  l&#297;nh v&#7921;c kh&aacute;c nhau.<br />
  Visual Studio 2005 l&agrave; m&#7897;t ng&ocirc;n ng&#7919; c&ograve;n kh&aacute; m&#7899;i m&#7867; v&agrave; &#273;&#7847;y h&#7913;a  h&#7865;n, c&aacute;c c&ocirc;ng ngh&#7879; ph&aacute;t tri&#7875;n &#7913;ng d&#7909;ng v&#7873; qu&#7843;n l&yacute;.<br />
&#272;&#7873; t&agrave;i <strong>H&#7879; th&#7889;ng ch&#432;&#417;ng tr&igrave;nh qu&#7843;n l&yacute; h&oacute;a &#273;&#417;n t&iacute;nh  ti&#7873;n c&#7911;a nh&agrave; h&agrave;ng (c&oacute; kho&#7843;ng 30 b&agrave;n)</strong> &#273;&#432;&#7907;c x&acirc;y d&#7921;ng d&#7921;a v&agrave;o c&aacute;c ki&#7871;n th&#7913;c c&#417;  b&#7843;n v&#7873; nghi&#7879;p v&#7909; k&#7871;t h&#7907;p v&#7899;i c&ocirc;ng ngh&#7879; hi&#7879;n c&oacute; trong ng&ocirc;n ng&#7919;.</p>
<ul>
  <li>C&ocirc;ng ngh&#7879; s&#7917; d&#7909;ng: Net Framework 2.0.</li>
  <li>Ng&ocirc;n ng&#7919; l&#7853;p tr&igrave;nh: Visual Studio 2005.</li>
  <li>L&#432;u tr&#7919; d&#7919; li&#7879;u: SQL Express 2005.</li>
</ul>
<p><strong><A NAME = "5.2">5.2</A>. &#272;&aacute;nh gi&aacute; k&#7871;t qu&#7843;</strong><br />
    <strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <a name = "5.2.1">5.2.1.</a> K&#7871;t qu&#7843;  &#273;&#7841;t &#273;&#432;&#7907;c</strong><br />
  X&acirc;y d&#7921;ng &ldquo;H&#7879;  th&#7889;ng ch&#432;&#417;ng tr&igrave;nh qu&#7843;n l&yacute; h&oacute;a &#273;&#417;n t&iacute;nh ti&#7873;n c&#7911;a nh&agrave; h&agrave;ng (c&oacute; kho&#7843;ng 30 b&agrave;n)&rdquo;  ph&#7909;c v&#7909; cho vi&#7879;c thanh to&aacute;n h&oacute;a &#273;&#417;n nh&agrave; h&agrave;ng m&#7897;t c&aacute;ch nhanh ch&oacute;ng, thu&#7853;n ti&#7879;n  v&agrave; ch&iacute;nh x&aacute;c.<br />
  Trong &#273;&#7873; t&agrave;i  n&agrave;y, v&#7853;n d&#7909;ng c&aacute;c ki&#7871;n th&#7913;c c&#259;n b&#7843;n &#273;&atilde; h&#7885;c v&#7873; Visual Studio  2005, SQL Express 2005 c&ugrave;ng c&aacute;c nghi&#7879;p v&#7909; c&#417; b&#7843;n c&#7911;a vi&#7879;c qu&#7843;n l&yacute; nh&agrave; h&agrave;ng,  ch&uacute;ng em &#273;&atilde; x&acirc;y d&#7921;ng &#273;&#432;&#7907;c ch&#432;&#417;ng tr&igrave;nh c&oacute; th&#7875; &#273;&aacute;p &#7913;ng &#273;&#432;&#7907;c c&aacute;c y&ecirc;u c&#7847;u c&#417; b&#7843;n:</p>
<ul>
  <li>Qu&#7843;n l&yacute; nh&acirc;n vi&ecirc;n.</li>
  <li>Qu&#7843;n l&yacute; c&aacute;c m&oacute;n &#259;n, th&#7913;c u&#7889;ng.</li>
  <li>Qu&#7843;n l&yacute; h&oacute;a &#273;&#417;n thanh to&aacute;n.</li>
  <li>Th&#7889;ng k&ecirc; doanh thu theo ng&agrave;y, th&aacute;ng, kho&#7843;ng ng&agrave;y.</li>
  <li>Th&#7889;ng k&ecirc; s&#7889; l&#432;&#7907;ng kh&aacute;ch &#273;&#7871;n.</li>
  <li>Th&#7889;ng k&ecirc; s&#7889; th&#7913;c &#259;n, n&#432;&#7899;c u&#7889;ng &#273;&#432;&#7907;c b&aacute;n nhi&#7873;u nh&#7845;t.</li>
</ul>
<p><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <a name = "5.2.2">5.2.2.</a> Vi&#7879;c  ch&#432;a l&agrave;m &#273;&#432;&#7907;c</strong><br />
  M&#7863;c d&ugrave; r&#7845;t c&#7889;  g&#7855;ng, nh&#432;ng do ki&#7871;n th&#7913;c h&#7841;n h&#7865;p n&ecirc;n lu&#7853;n v&#259;n kh&ocirc;ng tr&aacute;nh kh&#7887;i thi&#7871;u s&oacute;t v&agrave; h&#7841;n  ch&#7871; nh&#432;:<br />
  <strong><A NAME = "5.3">5.3.</A> H&#432;&#7899;ng ph&aacute;t tri&#7875;n</strong><br />
  Trong th&#7901;i  gian t&#7899;i, ch&uacute;ng em s&#7869; c&#7889; g&#7855;ng kh&#7855;c ph&#7909;c nh&#7919;ng h&#7841;n ch&#7871; tr&ecirc;n v&agrave; m&#7903; r&#7897;ng th&ecirc;m c&aacute;c  t&iacute;nh n&#259;ng m&#7899;i c&#7911;a ch&#432;&#417;ng tr&igrave;nh nh&#432;:<br />
  &#272;&#7863;t m&oacute;n v&agrave;  thanh to&aacute;n qua m&#7841;ng.<br />
  Gh&eacute;p n&#7889;i v&#7899;i  c&aacute;c ch&#432;&#417;ng tr&igrave;nh qu&#7843;n l&yacute; nh&agrave; h&agrave;ng kh&aacute;c.</p>
</body>
</html>
