<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title></head>

<body>
<p align="center"><strong>CH&#431;&#416;NG 3:</strong><br />
    <strong>PH&Acirc;N T&Iacute;CH</strong></p>
<p align="left">&nbsp;</p>
<p align="left"><strong>N&#7897;i dung: </strong></p>
<blockquote>
  <p><strong><a href="#3.1">Nh&#7853;n di&#7879;n c&aacute;c t&aacute;c nh&acirc;n (Actor), m&#7909;c ti&ecirc;u c&#7911;a t&#7915;ng t&aacute;c  nh&acirc;n.</a></strong></p>
  <p><strong><a href="#3.2">S&#417; &#273;&#7891; use case.</a></strong></p>
  <p><strong><a href="#3.3">M&ocirc; t&#7843; c&aacute;c Use Case</a></strong><a href="#3.3">.</a><strong>. </strong></p>
  <p><strong><a href="#3.4">S&#417; &#273;&#7891; l&#7899;p</a></strong><a href="#3.4">.</a></p>
  <p><strong><a href="#3.5">M&ocirc; t&#7843; c&aacute;c l&#7899;p trong s&#417; &#273;&#7891; l&#7899;p</a></strong><a href="#3.5">.</a></p>
  <p align="left">&nbsp;</p>
</blockquote>
<p><strong><A NAME = "3.1">3.1</A>. Nh&#7853;n di&#7879;n c&aacute;c t&aacute;c nh&acirc;n (Actor), m&#7909;c ti&ecirc;u c&#7911;a t&#7915;ng t&aacute;c  nh&acirc;n.</strong></p>
<table border="1" cellspacing="0" cellpadding="0">
  <tr>
    <td width="144" valign="top"><br />
        <strong>T&aacute;c Nh&acirc;n</strong> </td>
    <td width="408" valign="top"><p><strong>M&#7909;c Ti&ecirc;u</strong></p></td>
  </tr>
  <tr>
    <td width="144" valign="top"><p>Thu Ng&acirc;n</p></td>
    <td width="408" valign="top"><ul>
      <li>&#272;&#259;ng nh&#7853;p v&agrave;o h&#7879; th&#7889;ng.</li>
      <li>L&#7853;p h&oacute;a &#273;&#417;n.</li>
      <li>Tra c&#7913;u th&#7921;c &#273;&#417;n.</li>
      <li>Tra c&#7913;u nh&acirc;n vi&ecirc;n.</li>
      <li>Th&#7889;ng k&ecirc; doanh thu theo ng&agrave;y.</li>
      <li>Th&#7889;ng k&ecirc; doanh thu theo kho&#7843;ng ng&agrave;y.</li>
      <li>Th&#7889;ng k&ecirc; doanh thu theo th&aacute;ng n&#259;m.</li>
    </ul></td>
  </tr>
  <tr>
    <td width="144" valign="top"><p>Qu&#7843;n l&yacute;</p></td>
    <td width="408" valign="top"><ul>
      <li>&#272;&#259;ng nh&#7853;p v&agrave;o h&#7879; th&#7889;ng.</li>
      <li>L&#7853;p h&oacute;a &#273;&#417;n.</li>
      <li>Tra c&#7913;u th&#7921;c &#273;&#417;n.</li>
      <li>Tra c&#7913;u nh&acirc;n vi&ecirc;n.</li>
      <li>Th&#7889;ng k&ecirc; doanh thu theo ng&agrave;y.</li>
      <li>Th&#7889;ng k&ecirc; doanh thu theo kho&#7843;ng ng&agrave;y.</li>
      <li>Th&#7889;ng k&ecirc; doanh thu theo th&aacute;ng n&#259;m.</li>
      <li>Qu&#7843;n l&yacute; th&ecirc;m, x&oacute;a, s&#7917;a Nh&acirc;n vi&ecirc;n.</li>
      <li>Qu&#7843;n l&yacute; th&ecirc;m, x&oacute;a, s&#7917;a Th&#7921;c &#273;&#417;n.</li>
      <li>Ph&acirc;n c&ocirc;ng nh&acirc;n vi&ecirc;n.</li>
      <li>X&oacute;a h&oacute;a &#273;&#417;n.</li>
    </ul></td>
  </tr>
</table>
<p><strong>&nbsp;</strong></p>
<p><strong><br clear="all" />
  <A NAME = "3.2">3.2.</A> S&#417; &#273;&#7891; use case:</strong></p>
<p align="center"><img src="Images/FIG03-01.jpg" width="684" height="332" /></p>
<p align="center">H&igrave;nh 3.1: S&#417; &#273;&#7891; Use Case.</p>
<p><strong><A NAME = "3.3">3.3</A>. M&ocirc; t&#7843;  c&aacute;c Use Case</strong><br />
    <strong><a name = "3.3.1">3.3.1.</a> &#272;&#259;ng nh&#7853;p h&#7879; th&#7889;ng</strong></p>
<ul>
  <li><strong>T&ecirc;n Use Case: </strong>&#273;&#259;ng nh&#7853;p h&#7879; th&#7889;ng.</li>
  <li><strong>T&aacute;c nh&acirc;n: </strong>Qu&#7843;n l&yacute;, Thu ng&acirc;n.</li>
  <li><strong>&#272;i&#7873;u  ki&#7879;n ti&ecirc;n quy&#7871;t (Pre &ndash; conditions): </strong> </li>
  <li><strong>&#272;i&#7873;u ki&#7879;n  ho&agrave;n th&agrave;nh (Post &ndash; conditions):</strong> Qu&#7843;n l&yacute; ho&#7863;c thu ng&acirc;n &#273;&#432;&#7907;c h&#7879; th&#7889;ng  nh&#7853;n di&#7879;n.</li>
  <li><strong>D&ograve;ng s&#7921; ki&#7879;n ch&iacute;nh (Main  Flow): </strong>
    <ul>
      <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n y&ecirc;u c&#7847;u h&#7879; th&#7889;ng cho &#273;&#259;ng nh&#7853;p.</li>
      <li>H&#7879; th&#7889;ng y&ecirc;u c&#7847;u Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n nh&#7853;p th&ocirc;ng tin &#273;&#259;ng  nh&#7853;p.</li>
      <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n nh&#7853;p th&ocirc;ng tin &#273;&#259;ng nh&#7853;p.</li>
      <li>H&#7879; th&#7889;ng x&aacute;c nh&#7853;n th&ocirc;ng tin &#273;&#259;ng nh&#7853;p v&agrave; th&ocirc;ng b&aacute;o k&#7871;t qu&#7843;.</li>
    </ul>
  </li>

  <li><strong>D&ograve;ng s&#7921; ki&#7879;n ph&#7909;  (Extension):</strong>
    <ul>
      <li>N&#7871;u trong qu&aacute; tr&igrave;nh th&#7921;c hi&#7879;n h&#7879; th&#7889;ng b&#7883; d&#7915;ng b&#7845;t ng&#7901;:
        <ul>
          <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n kh&#7903;i  &#273;&#7897;ng l&#7841;i h&#7879; th&#7889;ng.</li>
          <li>H&#7879; th&#7889;ng h&#7911;y b&#7887; c&aacute;c thao  t&aacute;c tr&#432;&#7899;c &#273;&oacute; v&agrave; tr&#7903; v&#7873; tr&#7841;ng th&aacute;i ho&#7841;t &#273;&#7897;ng b&igrave;nh th&#432;&#7901;ng.</li>
        </ul>
      </li>
      <li>N&#7871;u Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n kh&ocirc;ng nh&#7853;p t&ecirc;n &#273;&#259;ng nh&#7853;p:
        <ul>
          <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o: &ldquo;T&ecirc;n  &#273;&#259;ng nh&#7853;p kh&ocirc;ng &#273;&#432;&#7907;c r&#7895;ng!&rdquo;.</li>
          <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n nh&#7853;p  l&#7841;i t&ecirc;n &#273;&#259;ng nh&#7853;p.</li>
        </ul>
      </li>
      <li>N&#7871;u Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n kh&ocirc;ng nh&#7853;p m&#7853;t kh&#7849;u:
        <ul>
          <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o: &ldquo;M&#7853;t  kh&#7849;u kh&ocirc;ng &#273;&#432;&#7907;c r&#7895;ng!&rdquo;.</li>
          <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n nh&#7853;p  l&#7841;i m&#7853;t kh&#7849;u.</li>
        </ul>
      </li>
      <li>N&#7871;u Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n nh&#7853;p kh&ocirc;ng &#273;&uacute;ng th&ocirc;ng tin &#273;&#259;ng  nh&#7853;p:
        <ul>
          <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o: &ldquo;T&ecirc;n  &#273;&#259;ng nh&#7853;p ho&#7863;c m&#7853;t kh&#7849;u kh&ocirc;ng ch&iacute;nh x&aacute;c!&rdquo;.</li>
          <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n nh&#7853;p  l&#7841;i th&ocirc;ng tin &#273;&#259;ng nh&#7853;p.</li>
        </ul>
      </li>
      <li>N&#7871;u Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n ch&#7885;n H&#7911;y B&#7887;, h&#7879; th&#7889;ng tho&aacute;t kh&#7887;i  ch&#432;&#417;ng tr&igrave;nh.<strong> </strong></li>
    </ul>
  </li>
</ul>
<p><strong><a name = "3.3.2">3.3.2.</a> L&#7853;p h&oacute;a &#273;&#417;n</strong></p>
<ul>
  <li><strong>T&ecirc;n Use Case: </strong>L&#7853;p h&oacute;a &#273;&#417;n.</li>
  <li><strong>T&aacute;c nh&acirc;n: </strong>Qu&#7843;n l&yacute;, Thu ng&acirc;n.</li>
  <li><strong>&#272;i&#7873;u ki&#7879;n ti&ecirc;n quy&#7871;t (Pre  &ndash; conditions): </strong>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n ph&#7843;i &#273;&#432;&#7907;c h&#7879; th&#7889;ng nh&#7853;n di&#7879;n v&agrave; &#7911;y quy&#7873;n s&#7917; d&#7909;ng h&#7879;  th&#7889;ng.</li>
  <li><strong>&#272;i&#7873;u ki&#7879;n ho&agrave;n th&agrave;nh (Post  &ndash; conditions):</strong> M&#7897;t h&oacute;a &#273;&#417;n thanh to&aacute;n ti&#7873;n kh&aacute;ch h&agrave;ng &#273;&#432;&#7907;c l&#7853;p.</li>
  <li><strong>D&ograve;ng s&#7921; ki&#7879;n ch&iacute;nh (Main  Flow): </strong> </li>
  <ul>
    <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n y&ecirc;u c&#7847;u l&#7853;p h&oacute;a &#273;&#417;n.</li>
    <li>H&#7879; th&#7889;ng hi&#7875;n th&#7883; danh s&aacute;ch b&agrave;n &#273;&atilde; g&#7885;i m&oacute;n l&#432;u trong h&#7879;  th&#7889;ng.</li>
    <li>H&#7879; th&#7889;ng y&ecirc;u c&#7847;u Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n ch&#7885;n b&agrave;n c&#7847;n thanh  to&aacute;n.</li>
    <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n nh&#7853;p th&ocirc;ng tin nh&acirc;n vi&ecirc;n ti&#7871;p t&acirc;n, y&ecirc;u  c&#7847;u h&#7879; th&#7889;ng thanh to&aacute;n t&#7893;ng ti&#7873;n v&agrave; l&#7853;p h&oacute;a &#273;&#417;n.</li>
    <li>H&#7879; th&#7889;ng ghi nh&#7853;n th&ocirc;ng tin h&oacute;a &#273;&#417;n, th&ocirc;ng b&aacute;o k&#7871;t qu&#7843; v&agrave; in  h&oacute;a &#273;&#417;n (n&#7871;u c&oacute; y&ecirc;u c&#7847;u).</li>
  </ul>
  <li><strong>D&ograve;ng s&#7921; ki&#7879;n ph&#7909;  (Extension):</strong>
    <ul>
      <li>N&#7871;u trong qu&aacute; tr&igrave;nh th&#7921;c hi&#7879;n h&#7879; th&#7889;ng b&#7883; d&#7915;ng b&#7845;t ng&#7901;:
        <ul>
          <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n kh&#7903;i  &#273;&#7897;ng l&#7841;i h&#7879; th&#7889;ng.</li>
          <li>H&#7879; th&#7889;ng h&#7911;y b&#7887; c&aacute;c thao  t&aacute;c tr&#432;&#7899;c &#273;&oacute; v&agrave; tr&#7903; v&#7873; tr&#7841;ng th&aacute;i ho&#7841;t &#273;&#7897;ng b&igrave;nh th&#432;&#7901;ng.</li>
        </ul>
      </li>
      <li>N&#7871;u ch&#432;a c&oacute; th&ocirc;ng tin b&agrave;n g&#7885;i m&oacute;n trong h&#7879; th&#7889;ng:
        <ul>
          <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n y&ecirc;u  c&#7847;u h&#7879; th&#7889;ng cho nh&#7853;p th&ocirc;ng tin g&#7885;i m&oacute;n.</li>
          <li>H&#7879; th&#7889;ng th&#7921;c hi&#7879;n ch&#7913;c  n&#259;ng <em>G&#7885;i M&oacute;n.</em></li>
        </ul>
      </li>
      <li>N&#7871;u Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n kh&ocirc;ng y&ecirc;u c&#7847;u h&#7879; th&#7889;ng t&iacute;nh t&#7893;ng  ti&#7873;n:
        <ul>
          <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o: &ldquo;Ch&#432;a  t&iacute;nh t&#7893;ng ti&#7873;n!&rdquo;.</li>
          <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n y&ecirc;u  c&#7847;u h&#7879; th&#7889;ng thanh to&aacute;n t&#7893;ng ti&#7873;n h&oacute;a &#273;&#417;n.</li>
        </ul>
      </li>
      <li>N&#7871;u Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n kh&ocirc;ng &#273;&#7891;ng &yacute; in h&oacute;a &#273;&#417;n:
        <ul>
          <li>H&#7879; th&#7889;ng kh&ocirc;ng th&#7921;c hi&#7879;n  in h&oacute;a &#273;&#417;n.</li>
        </ul>
      </li>
    </ul>
  </li>
  <ul>
    <ul>
    </ul>
  </ul>
</ul>
<br clear="all" />
<p><strong><a name = "3.3.3">3.3.3.</a> Tra c&#7913;u th&#7921;c &#273;&#417;n theo t&ecirc;n th&#7921;c  &#273;&#417;n</strong></p>
<ul>
  <li><strong>T&ecirc;n Use Case: </strong>Tra c&#7913;u th&#7921;c &#273;&#417;n.</li>
  <li><strong>T&aacute;c nh&acirc;n: </strong>Qu&#7843;n l&yacute;, Thu ng&acirc;n.</li>
  <li><strong>&#272;i&#7873;u ki&#7879;n ti&ecirc;n quy&#7871;t (Pre  &ndash; conditions): </strong>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n ph&#7843;i &#273;&#432;&#7907;c h&#7879; th&#7889;ng nh&#7853;n di&#7879;n v&agrave; &#7911;y quy&#7873;n s&#7917; d&#7909;ng h&#7879;  th&#7889;ng.</li>
  <li><strong>&#272;i&#7873;u ki&#7879;n ho&agrave;n th&agrave;nh (Post  &ndash; conditions): </strong>Hi&#7875;n th&#7883; k&#7871;t qu&#7843; tra c&#7913;u th&ocirc;ng tin th&#7921;c &#273;&#417;n theo t&ecirc;n th&#7921;c &#273;&#417;n.</li>
  <li><strong>D&ograve;ng s&#7921; ki&#7879;n ch&iacute;nh (Main  Flow): </strong> </li>
  <ul>
    <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n y&ecirc;u c&#7847;u ch&#7913;c n&#259;ng tra c&#7913;u th&#7921;c &#273;&#417;n theo  t&ecirc;n th&#7921;c &#273;&#417;n.</li>
    <li>H&#7879; th&#7889;ng y&ecirc;u c&#7847;u Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n nh&#7853;p th&ocirc;ng tin t&ecirc;n  th&#7921;c &#273;&#417;n.</li>
    <li>H&#7879; th&#7889;ng hi&#7875;n th&#7883; k&#7871;t qu&#7843; tra c&#7913;u th&#7921;c &#273;&#417;n theo ti&ecirc;u ch&iacute; tra  c&#7913;u (t&ecirc;n th&#7921;c &#273;&#417;n).</li>
  </ul>
  <li><strong>D&ograve;ng s&#7921; ki&#7879;n ph&#7909;  (Extension):</strong>
    <ul>
      <li>N&#7871;u trong qu&aacute; tr&igrave;nh th&#7921;c hi&#7879;n h&#7879; th&#7889;ng b&#7883; d&#7915;ng b&#7845;t ng&#7901;:
        <ul>
          <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n&nbsp; kh&#7903;i &#273;&#7897;ng l&#7841;i h&#7879; th&#7889;ng.</li>
          <li>H&#7879; th&#7889;ng h&#7911;y b&#7887; c&aacute;c thao  t&aacute;c tr&#432;&#7899;c &#273;&oacute; v&agrave; tr&#7903; v&#7873; tr&#7841;ng th&aacute;i ho&#7841;t &#273;&#7897;ng b&igrave;nh th&#432;&#7901;ng.</li>
        </ul>
      </li>
      <li>N&#7871;u Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n kh&ocirc;ng nh&#7853;p t&ecirc;n th&#7921;c &#273;&#417;n tra c&#7913;u:
        <ul>
          <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o: &ldquo;Ch&#432;a  nh&#7853;p t&ecirc;n th&#7921;c &#273;&#417;n c&#7847;n tra c&#7913;u!&rdquo;.</li>
          <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n nh&#7853;p  t&ecirc;n th&#7921;c &#273;&#417;n c&#7847;n tra c&#7913;u.</li>
        </ul>
      </li>
      <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n c&oacute; th&#7875; kh&ocirc;ng nh&#7853;p t&ecirc;n th&#7921;c &#273;&#417;n.</li>
    </ul>
  </li>
</ul>
<p><strong><a name = "3.3.4">3.3.4.</a> Tra c&#7913;u th&ocirc;ng tin nh&acirc;n vi&ecirc;n  theo h&#7885; t&ecirc;n nh&acirc;n vi&ecirc;n</strong></p>
<ul>
  <li><strong>T&ecirc;n Use Case: </strong>Tra c&#7913;u th&ocirc;ng tin nh&acirc;n  vi&ecirc;n theo h&#7885; t&ecirc;n nh&acirc;n vi&ecirc;n</li>
  <li><strong>T&aacute;c nh&acirc;n: </strong>Qu&#7843;n l&yacute;, Thu ng&acirc;n.</li>
  <li><strong>&#272;i&#7873;u ki&#7879;n ti&ecirc;n quy&#7871;t (Pre  &ndash; conditions): </strong>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n ph&#7843;i &#273;&#432;&#7907;c h&#7879; th&#7889;ng nh&#7853;n di&#7879;n v&agrave; &#7911;y quy&#7873;n s&#7917; d&#7909;ng h&#7879;  th&#7889;ng.</li>
  <li><strong>&#272;i&#7873;u ki&#7879;n ho&agrave;n th&agrave;nh (Post  &ndash; conditions): </strong>Hi&#7875;n th&#7883; k&#7871;t qu&#7843; tra c&#7913;u th&ocirc;ng tin nh&acirc;n vi&ecirc;n theo h&#7885; t&ecirc;n nh&acirc;n vi&ecirc;n.</li>
</ul>
<ul>
  <li><strong>D&ograve;ng s&#7921; ki&#7879;n ch&iacute;nh (Main  Flow): </strong> </li>
  <ul>
    <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n y&ecirc;u c&#7847;u ch&#7913;c n&#259;ng tra c&#7913;u th&ocirc;ng tin  nh&acirc;n vi&ecirc;n theo h&#7885; t&ecirc;n nh&acirc;n vi&ecirc;n.</li>
    <li>H&#7879; th&#7889;ng y&ecirc;u c&#7847;u Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n nh&#7853;p h&#7885; t&ecirc;n nh&acirc;n vi&ecirc;n  c&#7847;n tra c&#7913;u.</li>
    <li>H&#7879; th&#7889;ng hi&#7875;n th&#7883; k&#7871;t qu&#7843; tra c&#7913;u nh&acirc;n vi&ecirc;n theo ti&ecirc;u ch&iacute; tra  c&#7913;u (t&ecirc;n nh&acirc;n vi&ecirc;n).</li>
  </ul>
  <li><strong>D&ograve;ng s&#7921; ki&#7879;n ph&#7909;  (Extension):</strong>
    <ul>
      <li>N&#7871;u trong qu&aacute; tr&igrave;nh th&#7921;c hi&#7879;n h&#7879; th&#7889;ng b&#7883; d&#7915;ng b&#7845;t ng&#7901;:
        <ul>
          <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n kh&#7903;i  &#273;&#7897;ng l&#7841;i h&#7879; th&#7889;ng.</li>
          <li>H&#7879; th&#7889;ng h&#7911;y b&#7887; c&aacute;c thao  t&aacute;c tr&#432;&#7899;c &#273;&oacute; v&agrave; tr&#7903; v&#7873; tr&#7841;ng th&aacute;i ho&#7841;t &#273;&#7897;ng b&igrave;nh th&#432;&#7901;ng.</li>
        </ul>
      </li>
      <li>N&#7871;u Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n kh&ocirc;ng nh&#7853;p t&ecirc;n nh&acirc;n vi&ecirc;n c&#7847;n tra  c&#7913;u:
        <ul>
          <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o: &ldquo;Ch&#432;a  nh&#7853;p t&ecirc;n nh&acirc;n vi&ecirc;n c&#7847;n tra c&#7913;u!&rdquo;.</li>
          <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n nh&#7853;p  t&ecirc;n nh&acirc;n vi&ecirc;n c&#7847;n tra c&#7913;u.</li>
        </ul>
      </li>
      <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n c&oacute; th&#7875; kh&ocirc;ng nh&#7853;p t&ecirc;n nh&acirc;n vi&ecirc;n.</li>
    </ul>
  </li>
</ul>
<p><strong><a name = "3.3.5">3.3.5.</a> Th&#7889;ng k&ecirc; doanh thu</strong></p>
<ul>
  <li><strong>T&ecirc;n Use Case: </strong>Th&#7889;ng k&ecirc; doanh thu.</li>
  <li><strong>T&aacute;c nh&acirc;n: </strong>Qu&#7843;n l&yacute;, Thu ng&acirc;n.</li>
  <li><strong>&#272;i&#7873;u ki&#7879;n ti&ecirc;n quy&#7871;t (Pre  &ndash; conditions): </strong>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n ph&#7843;i &#273;&#432;&#7907;c h&#7879; th&#7889;ng nh&#7853;n di&#7879;n v&agrave; &#7911;y quy&#7873;n s&#7917; d&#7909;ng h&#7879;  th&#7889;ng.</li>
  <li><strong>&#272;i&#7873;u ki&#7879;n ho&agrave;n th&agrave;nh (Post  &ndash; conditions): </strong>Th&#7889;ng k&ecirc; th&agrave;nh c&ocirc;ng doanh thu.</li>
  <li><strong>D&ograve;ng s&#7921; ki&#7879;n ch&iacute;nh (Main  Flow): </strong> </li>
  <ul>
    <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n y&ecirc;u c&#7847;u ch&#7913;c n&#259;ng th&#7889;ng k&ecirc; doanh thu.</li>
    <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n ch&#7885;n ti&ecirc;u ch&iacute; &#273;&#7875; th&#7889;ng k&ecirc;, c&aacute;c ti&ecirc;u ch&iacute;  bao g&#7891;m: ng&agrave;y, th&aacute;ng n&#259;m, kho&#7843;ng ng&agrave;y v&agrave; nh&#7853;p th&ocirc;ng tin theo ti&ecirc;u ch&iacute; &#273;&atilde; ch&#7885;n.</li>
    <li>H&#7879; th&#7889;ng th&#7889;ng k&ecirc; doanh thu theo ti&ecirc;u ch&iacute; &#273;&atilde; ch&#7885;n v&agrave; tr&#7843; v&#7873;  k&#7871;t qu&#7843; (t&#7893;ng doanh thu; s&#7889; kh&aacute;ch &#273;&#7871;n; th&#7921;c &#273;&#417;n, th&#7913;c u&#7889;ng &#273;&#432;&#7907;c b&aacute;n nhi&#7873;u  nh&#7845;t).</li>
  </ul>
</ul>
<strong><br clear="all" />
</strong>
<ul>
  <li><strong>D&ograve;ng s&#7921; ki&#7879;n ph&#7909;  (Extension):</strong>
    <ul>
      <li>N&#7871;u trong qu&aacute; tr&igrave;nh th&#7921;c hi&#7879;n h&#7879; th&#7889;ng b&#7883; d&#7915;ng b&#7845;t ng&#7901;:
        <ul>
          <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n kh&#7903;i  &#273;&#7897;ng l&#7841;i h&#7879; th&#7889;ng.</li>
          <li>H&#7879; th&#7889;ng h&#7911;y b&#7887; c&aacute;c thao  t&aacute;c tr&#432;&#7899;c &#273;&oacute; v&agrave; tr&#7903; v&#7873; tr&#7841;ng th&aacute;i ho&#7841;t &#273;&#7897;ng b&igrave;nh th&#432;&#7901;ng.</li>
        </ul>
      </li>
      <li>N&#7871;u Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n kh&ocirc;ng nh&#7853;p th&ocirc;ng tin theo ti&ecirc;u ch&iacute;  th&#7889;ng k&ecirc; &#273;&atilde; ch&#7885;n:
        <ul>
          <li>N&#7871;u Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n  kh&ocirc;ng ch&#7885;n ng&agrave;y, h&#7879; th&#7889;ng th&ocirc;ng b&aacute;o: &ldquo;M&#7901;i ch&#7885;n ng&agrave;y c&#7847;n th&#7889;ng k&ecirc;!&rdquo;.</li>
          <li>N&#7871;u Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n  kh&ocirc;ng ch&#7885;n th&aacute;ng v&agrave; n&#259;m, h&#7879; th&#7889;ng th&ocirc;ng b&aacute;o: &ldquo;M&#7901;i ch&#7885;n th&aacute;ng c&#7847;n th&#7889;ng k&ecirc;!&rdquo;.</li>
          <li>N&#7871;u Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n  kh&ocirc;ng ch&#7885;n m&#7889;c ng&agrave;y th&#7889;ng k&ecirc; (th&#7889;ng k&ecirc; theo kho&#7843;ng ng&agrave;y), h&#7879; th&#7889;ng th&ocirc;ng b&aacute;o:  &ldquo;Ch&#432;a ch&#7885;n m&#7889;c ng&agrave;y th&#7889;ng k&ecirc;!&rdquo;.</li>
        </ul>
      </li>
      <li>Qu&#7843;n l&yacute; ho&#7863;c Thu ng&acirc;n c&oacute; th&#7875; kh&ocirc;ng nh&#7853;p c&aacute;c th&ocirc;ng tin ti&ecirc;u  ch&iacute; th&#7889;ng k&ecirc;.</li>
    </ul>
  </li>
</ul>
<p><strong><a name = "3.3.6">3.3.6.</a> Qu&#7843;n l&yacute; nh&acirc;n vi&ecirc;n</strong></p>
<ul>
  <li><strong>Th&ecirc;m nh&acirc;n vi&ecirc;n:</strong>
    <ul>
      <li><strong>T&ecirc;n Use Case:</strong> Th&ecirc;m nh&acirc;n vi&ecirc;n.</li>
      <li><strong>T&aacute;c nh&acirc;n: </strong>Qu&#7843;n l&yacute;.</li>
      <li><strong>&#272;i&#7873;u ki&#7879;n ti&ecirc;n quy&#7871;t (Pre  &ndash; conditions): </strong>Qu&#7843;n l&yacute; ph&#7843;i &#273;&#432;&#7907;c h&#7879; th&#7889;ng nh&#7853;n di&#7879;n v&agrave; &#7911;y quy&#7873;n s&#7917; d&#7909;ng h&#7879; th&#7889;ng.</li>
      <li><strong>&#272;i&#7873;u ki&#7879;n ho&agrave;n th&agrave;nh (Post  &ndash; conditions):</strong> Th&ocirc;ng tin nh&acirc;n vi&ecirc;n m&#7899;i &#273;&#432;&#7907;c ghi nh&#7853;n v&agrave;o h&#7879; th&#7889;ng.</li>
      <li><strong>D&ograve;ng s&#7921; ki&#7879;n ch&iacute;nh (Main  Flow):</strong>
        <ul>
          <li>Qu&#7843;n l&yacute; y&ecirc;u c&#7847;u ch&#7913;c n&#259;ng th&ecirc;m nh&acirc;n vi&ecirc;n.</li>
          <li>H&#7879; th&#7889;ng y&ecirc;u c&#7847;u Qu&#7843;n l&yacute; nh&#7853;p th&ocirc;ng tin nh&acirc;n vi&ecirc;n m&#7899;i.
            <ul>
              <li>Th&ocirc;ng tin nh&acirc;n vi&ecirc;n g&#7891;m: Quy&#7873;n, H&#7885; t&ecirc;n nh&acirc;n vi&ecirc;n, Ng&agrave;y sinh, T&ecirc;n &#273;&#259;ng  nh&#7853;p, M&#7853;t kh&#7849;u, X&aacute;c nh&#7853;n m&#7853;t kh&#7849;u.</li>
              <li>N&#7871;u Quy&#7873;n c&#7911;a nh&acirc;n vi&ecirc;n m&#7899;i l&agrave; Ti&#7871;p T&acirc;n:
                <ul>
                  <li>H&#7879; th&#7889;ng y&ecirc;u c&#7847;u Qu&#7843;n l&yacute;  nh&#7853;p H&#7885; t&ecirc;n nh&acirc;n vi&ecirc;n, Ng&agrave;y sinh (kh&ocirc;ng nh&#7853;p T&ecirc;n &#273;&#259;ng nh&#7853;p, M&#7853;t kh&#7849;u v&agrave; X&aacute;c  nh&#7853;n m&#7853;t kh&#7849;u). </li>
                </ul>
              </li>
            </ul>
          </li>
          <ul>
            <li>N&#7871;u Quy&#7873;n c&#7911;a nh&acirc;n vi&ecirc;n m&#7899;i l&agrave; Thu Ng&acirc;n:
              <ul>
                <li>H&#7879; th&#7889;ng y&ecirc;u c&#7847;u Qu&#7843;n l&yacute;  nh&#7853;p H&#7885; t&ecirc;n nh&acirc;n vi&ecirc;n, Ng&agrave;y sinh, T&ecirc;n &#273;&#259;ng nh&#7853;p, M&#7853;t kh&#7849;u, X&aacute;c nh&#7853;n m&#7853;t kh&#7849;u.</li>
              </ul>
            </li>
          </ul>
          <li>Qu&#7843;n l&yacute; nh&#7853;p th&ocirc;ng tin nh&acirc;n vi&ecirc;n m&#7899;i v&agrave; y&ecirc;u c&#7847;u h&#7879; th&#7889;ng ghi  nh&#7853;n.</li>
          <li>H&#7879; th&#7889;ng ghi nh&#7853;n th&ocirc;ng tin nh&acirc;n vi&ecirc;n m&#7899;i v&agrave; th&ocirc;ng b&aacute;o k&#7871;t  qu&#7843;.</li>
        </ul>
      </li>
    </ul>
  </li>
  <ul>
    <ul><ul>
  </ul>
    </ul>
  
    <li><strong>D&ograve;ng s&#7921; ki&#7879;n ph&#7909;  (Extension):</strong> 
      <ul>
        <li><strong>N&#7871;u Quy&#7873;n c&#7911;a nh&acirc;n vi&ecirc;n  m&#7899;i l&agrave; Ti&#7871;p T&acirc;n:</strong>
          <ul>
            <li>N&#7871;u trong qu&aacute; tr&igrave;nh th&#7921;c hi&#7879;n h&#7879; th&#7889;ng b&#7883; d&#7915;ng b&#7845;t ng&#7901;:
              <ul>
                <li>Qu&#7843;n l&yacute; kh&#7903;i &#273;&#7897;ng l&#7841;i h&#7879; th&#7889;ng.</li>
                <li>H&#7879; th&#7889;ng h&#7911;y c&aacute;c thao t&aacute;c tr&#432;&#7899;c &#273;&oacute; v&agrave; tr&#7903; v&#7873; tr&#7841;ng th&aacute;i ho&#7841;t  &#273;&#7897;ng b&igrave;nh th&#432;&#7901;ng.</li>
              </ul>
            </li>
            <li>N&#7871;u Qu&#7843;n l&yacute; kh&ocirc;ng nh&#7853;p H&#7885; t&ecirc;n nh&acirc;n vi&ecirc;n:
              <ul>
                <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;H&#7885; t&ecirc;n nh&acirc;n vi&ecirc;n kh&ocirc;ng &#273;&#432;&#7907;c r&#7895;ng!&rdquo;.</li>
                <li>Qu&#7843;n l&yacute; nh&#7853;p h&#7885; t&ecirc;n nh&acirc;n vi&ecirc;n c&#7847;n th&ecirc;m.</li>
              </ul>
            </li>
            <li>N&#7871;u Qu&#7843;n l&yacute; kh&ocirc;ng nh&#7853;p Ng&agrave;y sinh:
              <ul>
                <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Ng&agrave;y sinh kh&ocirc;ng &#273;&#432;&#7907;c r&#7895;ng!&rdquo;.</li>
                <li>Qu&#7843;n l&yacute; nh&#7853;p ng&agrave;y sinh nh&acirc;n vi&ecirc;n c&#7847;n th&ecirc;m.</li>
              </ul>
            </li>
            <li>Qu&#7843;n l&yacute; c&oacute; th&#7875; kh&ocirc;ng nh&#7853;p th&ocirc;ng tin nh&acirc;n vi&ecirc;n m&#7899;i.</li>
          </ul>
        </li>
      </ul>
    </li>
    <ul>
      <ul>
        <ul>
        </ul>
      </ul>
      <li><strong>N&#7871;u Quy&#7873;n c&#7911;a nh&acirc;n vi&ecirc;n  m&#7899;i l&agrave; Thu Ng&acirc;n:</strong>
        <ul>
          <li>N&#7871;u trong qu&aacute; tr&igrave;nh th&#7921;c hi&#7879;n h&#7879; th&#7889;ng b&#7883; d&#7915;ng b&#7845;t ng&#7901;:
            <ul>
              <li>Qu&#7843;n l&yacute; kh&#7903;i &#273;&#7897;ng l&#7841;i h&#7879;  th&#7889;ng.</li>
              <li>H&#7879; th&#7889;ng h&#7911;y c&aacute;c thao t&aacute;c  tr&#432;&#7899;c &#273;&oacute; v&agrave; tr&#7903; v&#7873; tr&#7841;ng th&aacute;i ho&#7841;t &#273;&#7897;ng b&igrave;nh th&#432;&#7901;ng.</li>
            </ul>
          </li>
          <li>N&#7871;u Qu&#7843;n l&yacute; kh&ocirc;ng nh&#7853;p H&#7885; t&ecirc;n nh&acirc;n vi&ecirc;n:
            <ul>
              <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;H&#7885; t&ecirc;n  nh&acirc;n vi&ecirc;n kh&ocirc;ng &#273;&#432;&#7907;c r&#7895;ng!&rdquo;.</li>
              <li>Qu&#7843;n l&yacute; nh&#7853;p h&#7885; t&ecirc;n nh&acirc;n  vi&ecirc;n c&#7847;n th&ecirc;m.</li>
            </ul>
          </li>
          <li>N&#7871;u Qu&#7843;n l&yacute; kh&ocirc;ng nh&#7853;p Ng&agrave;y sinh:
            <ul>
              <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Ng&agrave;y  sinh kh&ocirc;ng &#273;&#432;&#7907;c r&#7895;ng!&rdquo;.</li>
              <li>Qu&#7843;n l&yacute; nh&#7853;p ng&agrave;y sinh  nh&acirc;n vi&ecirc;n c&#7847;n th&ecirc;m.</li>
            </ul>
          </li>
          <li>N&#7871;u Qu&#7843;n l&yacute; kh&ocirc;ng nh&#7853;p T&ecirc;n &#273;&#259;ng nh&#7853;p ho&#7863;c T&ecirc;n &#273;&#259;ng nh&#7853;p nh&#7887;  h&#417;n 6 k&yacute; t&#7921; ho&#7863;c l&#7899;n h&#417;n 20 k&yacute; t&#7921;:</li>
          <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;T&ecirc;n  &#273;&#259;ng nh&#7853;p ph&#7843;i l&#7899;n h&#417;n 5 v&agrave; nh&#7887; h&#417;n 21 k&yacute; t&#7921;!&rdquo;.
            <ul>
              <li>Qu&#7843;n l&yacute; nh&#7853;p l&#7841;i T&ecirc;n &#273;&#259;ng  nh&#7853;p.</li>
            </ul>
          </li>
          <li>N&#7871;u Qu&#7843;n l&yacute; kh&ocirc;ng nh&#7853;p M&#7853;t kh&#7849;u ho&#7863;c M&#7853;t kh&#7849;u nh&#7887; h&#417;n 6 k&yacute; t&#7921;  ho&#7863;c l&#7899;n h&#417;n 20 k&yacute; t&#7921;:
            <ul>
              <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;M&#7853;t  kh&#7849;u ph&#7843;i l&#7899;n h&#417;n 5 v&agrave; nh&#7887; h&#417;n 21 k&yacute; t&#7921;!&rdquo;.</li>
              <li>Qu&#7843;n l&yacute; nh&#7853;p l&#7841;i M&#7853;t kh&#7849;u.</li>
            </ul>
          </li>
          <li>N&#7871;u Qu&#7843;n l&yacute; kh&ocirc;ng nh&#7853;p X&aacute;c nh&#7853;n m&#7853;t kh&#7849;u ho&#7863;c X&aacute;c nh&#7853;n m&#7853;t  kh&#7849;u kh&ocirc;ng tr&ugrave;ng v&#7899;i M&#7853;t kh&#7849;u:
            <ul>
              <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;M&#7853;t  kh&#7849;u kh&ocirc;ng tr&ugrave;ng!&rdquo;.</li>
              <li>Qu&#7843;n l&yacute; nh&#7853;p l&#7841;i X&aacute;c nh&#7853;n  m&#7853;t kh&#7849;u.</li>
            </ul>
          </li>
          <li>Qu&#7843;n l&yacute; c&oacute; th&#7875; kh&ocirc;ng nh&#7853;p th&ocirc;ng tin nh&acirc;n vi&ecirc;n m&#7899;i.</li>
        </ul>
      </li>
    </ul>
  </ul>
</ul>
<ul>
  <li><strong>C&#7853;p nh&#7853;t th&ocirc;ng tin nh&acirc;n  vi&ecirc;n:</strong></li>
</ul>
<ul>
  <li><strong>T&ecirc;n Use Case:</strong> C&#7853;p nh&#7853;t th&ocirc;ng tin nh&acirc;n  vi&ecirc;n.<strong></strong></li>
  <li><strong>T&aacute;c nh&acirc;n: </strong>Qu&#7843;n l&yacute;.<strong></strong></li>
  <li><strong>&#272;i&#7873;u ki&#7879;n ti&ecirc;n quy&#7871;t (Pre  &ndash; conditions): </strong>Qu&#7843;n l&yacute; ph&#7843;i &#273;&#432;&#7907;c h&#7879; th&#7889;ng nh&#7853;n di&#7879;n v&agrave; &#7911;y quy&#7873;n s&#7917; d&#7909;ng h&#7879; th&#7889;ng.<strong></strong></li>
  <li><strong>&#272;i&#7873;u ki&#7879;n ho&agrave;n th&agrave;nh (Post  &ndash; conditions): </strong>C&#7853;p nh&#7853;t th&agrave;nh c&ocirc;ng th&ocirc;ng tin nh&acirc;n vi&ecirc;n.<strong></strong></li>
  <li><strong>D&ograve;ng s&#7921; ki&#7879;n ch&iacute;nh (Main  Flow):</strong>
    <ul>
      <li>Qu&#7843;n l&yacute; y&ecirc;u c&#7847;u ch&#7913;c n&#259;ng c&#7853;p nh&#7853;t th&ocirc;ng tin nh&acirc;n vi&ecirc;n.</li>
      <li>H&#7879; th&#7889;ng hi&#7875;n th&#7883; danh s&aacute;ch nh&acirc;n vi&ecirc;n c&oacute; trong h&#7879; th&#7889;ng.</li>
      <li>Qu&#7843;n l&yacute; ch&#7885;n nh&acirc;n vi&ecirc;n c&#7847;n c&#7853;p nh&#7853;t th&ocirc;ng tin.</li>
      <li>H&#7879; th&#7889;ng hi&#7875;n th&#7883; th&ocirc;ng tin nh&acirc;n vi&ecirc;n v&#7915;a &#273;&#432;&#7907;c ch&#7885;n.</li>
      <li>Qu&#7843;n l&yacute; nh&#7853;p nh&#7919;ng th&ocirc;ng tin mu&#7889;n c&#7853;p nh&#7853;t v&agrave; y&ecirc;u c&#7847;u h&#7879;  th&#7889;ng ghi nh&#7853;n.</li>
      <li>C&oacute; 2 tr&#432;&#7901;ng h&#7907;p ch&iacute;nh:
        <ul>
          <li>Tr&#432;&#7901;ng h&#7907;p 1: C&#7853;p nh&#7853;t th&ocirc;ng tin nh&acirc;n vi&ecirc;n nh&#432;ng kh&ocirc;ng thay  &#273;&#7893;i Quy&#7873;n: C&oacute; 2 tr&#432;&#7901;ng h&#7907;p:</li>
        </ul>
      </li>
    </ul>
  </li>
  <ul>
    <ul><ul><ul><ul><ul>
  </ul>
            </ul>
          </ul>
        </ul>
      <li>Tr&#432;&#7901;ng h&#7907;p 1.1: Nh&acirc;n vi&ecirc;n &#273;&#432;&#7907;c c&#7853;p nh&#7853;t l&agrave; Ti&#7871;p T&acirc;n:</li>
      <ul>
        <li>Nh&#7919;ng th&ocirc;ng tin c&oacute; th&#7875; c&#7853;p  nh&#7853;t: H&#7885; t&ecirc;n nh&acirc;n vi&ecirc;n, Ng&agrave;y sinh.</li>
      </ul>
      <li>Tr&#432;&#7901;ng h&#7907;p 1.2: Nh&acirc;n vi&ecirc;n &#273;&#432;&#7907;c c&#7853;p nh&#7853;t l&agrave; Thu Ng&acirc;n:</li>
      <ul>
        <li>Nh&#7919;ng th&ocirc;ng tin c&oacute; th&#7875; c&#7853;p  nh&#7853;t: H&#7885; t&ecirc;n nh&acirc;n vi&ecirc;n, Ng&agrave;y sinh, T&ecirc;n &#273;&#259;ng nh&#7853;p, M&#7853;t kh&#7849;u, X&aacute;c nh&#7853;n m&#7853;t kh&#7849;u.</li>
        <ul>
          <ul>
            <ul>
              <ul>
                <ul>
                  <li>Tr&#432;&#7901;ng h&#7907;p 2: C&#7853;p nh&#7853;t th&ocirc;ng tin nh&acirc;n vi&ecirc;n c&oacute; thay &#273;&#7893;i Quy&#7873;n:  C&oacute; 2 tr&#432;&#7901;ng h&#7907;p:</li>
                </ul>
              </ul>
            </ul>
          </ul>
        </ul>
      </ul>
      <li>Tr&#432;&#7901;ng h&#7907;p 2.1: C&#7853;p nh&#7853;t Quy&#7873;n nh&acirc;n vi&ecirc;n Ti&#7871;p T&acirc;n sang Thu  Ng&acirc;n:</li>
      <ul>
        <li>Nh&#7919;ng th&ocirc;ng tin c&oacute; th&#7875; c&#7853;p  nh&#7853;t: H&#7885; t&ecirc;n nh&acirc;n vi&ecirc;n, Ng&agrave;y sinh</li>
        <li>Nh&#7919;ng th&ocirc;ng tin c&#7847;n nh&#7853;p:  T&ecirc;n &#273;&#259;ng nh&#7853;p, M&#7853;t kh&#7849;u, X&aacute;c nh&#7853;n m&#7853;t kh&#7849;u.</li>
      </ul>
      <li>Tr&#432;&#7901;ng h&#7907;p 2.2: C&#7853;p nh&#7853;t Quy&#7873;n nh&acirc;n vi&ecirc;n Thu Ng&acirc;n sang Ti&#7871;p  T&acirc;n:</li>
      <ul>
        <li>Nh&#7919;ng th&ocirc;ng tin c&oacute; th&#7875; c&#7853;p  nh&#7853;t: H&#7885; t&ecirc;n nh&acirc;n vi&ecirc;n, Ng&agrave;y sinh.</li>
        <li>X&oacute;a th&ocirc;ng tin T&ecirc;n &#273;&#259;ng  nh&#7853;p, M&#7853;t kh&#7849;u c&#7911;a nh&acirc;n vi&ecirc;n.</li>
        <ul>
          <ul>
            <li>H&#7879; th&#7889;ng ghi nh&#7853;n th&ocirc;ng tin nh&acirc;n vi&ecirc;n &#273;&#432;&#7907;c c&#7853;p nh&#7853;t v&agrave; th&ocirc;ng  b&aacute;o k&#7871;t qu&#7843;.</li>
          </ul>
        </ul>
      </ul>
    </ul>
  </ul>
  <li><strong>D&ograve;ng s&#7921; ki&#7879;n ph&#7909;  (Extension):</strong>
    <ul>
      <li>N&#7871;u trong qu&aacute; tr&igrave;nh th&#7921;c hi&#7879;n h&#7879; th&#7889;ng b&#7883; d&#7915;ng b&#7845;t ng&#7901;:
        <ul>
          <li>Qu&#7843;n l&yacute; kh&#7903;i &#273;&#7897;ng l&#7841;i h&#7879;  th&#7889;ng.</li>
          <li>H&#7879; th&#7889;ng h&#7911;y c&aacute;c thao t&aacute;c  tr&#432;&#7899;c &#273;&oacute; v&agrave; tr&#7903; v&#7873; tr&#7841;ng th&aacute;i ho&#7841;t &#273;&#7897;ng b&igrave;nh th&#432;&#7901;ng.</li>
        </ul>
      </li>
      <li>N&#7871;u H&#7885; t&ecirc;n nh&acirc;n vi&ecirc;n r&#7895;ng:
        <ul>
          <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;H&#7885; t&ecirc;n  nh&acirc;n vi&ecirc;n kh&ocirc;ng &#273;&#432;&#7907;c r&#7895;ng!&rdquo;.</li>
          <li>Qu&#7843;n l&yacute; nh&#7853;p H&#7885; t&ecirc;n nh&acirc;n  vi&ecirc;n.</li>
        </ul>
      </li>
      <li>N&#7871;u Ng&agrave;y sinh r&#7895;ng:H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Ng&agrave;y  sinh kh&ocirc;ng &#273;&#432;&#7907;c r&#7895;ng!&rdquo;.
        <ul>
          <li>Qu&#7843;n l&yacute; nh&#7853;p Ng&agrave;y sinh.</li>
        </ul>
      </li>
      <li>N&#7871;u T&ecirc;n &#273;&#259;ng nh&#7853;p r&#7895;ng ho&#7863;c T&ecirc;n &#273;&#259;ng nh&#7853;p nh&#7887; h&#417;n 6 k&yacute; t&#7921;  ho&#7863;c l&#7899;n h&#417;n 20 k&yacute; t&#7921;:</li>
      <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;T&ecirc;n  &#273;&#259;ng nh&#7853;p ph&#7843;i l&#7899;n h&#417;n 5 v&agrave; nh&#7887; h&#417;n 21 k&yacute; t&#7921;!&rdquo;.
        <ul>
          <li>Qu&#7843;n l&yacute; nh&#7853;p T&ecirc;n &#273;&#259;ng  nh&#7853;p.</li>
        </ul>
      </li>
      <li>N&#7871;u M&#7853;t kh&#7849;u r&#7895;ng ho&#7863;c M&#7853;t kh&#7849;u nh&#7887; h&#417;n 6 k&yacute; t&#7921; ho&#7863;c l&#7899;n h&#417;n  20 k&yacute; t&#7921;:
        <ul>
          <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;M&#7853;t  kh&#7849;u ph&#7843;i l&#7899;n h&#417;n 5 k&yacute; t&#7921; v&agrave; nh&#7887; h&#417;n 21 k&yacute; t&#7921;!&rdquo;.</li>
          <li>Qu&#7843;n l&yacute; nh&#7853;p M&#7853;t kh&#7849;u.</li>
        </ul>
      </li>
      <li>N&#7871;u X&aacute;c nh&#7853;n m&#7853;t kh&#7849;u r&#7895;ng ho&#7863;c kh&aacute;c M&#7853;t kh&#7849;u:
        <ul>
          <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;M&#7853;t  kh&#7849;u kh&ocirc;ng tr&ugrave;ng!&rdquo;.</li>
          <li>Qu&#7843;n l&yacute; nh&#7853;p X&aacute;c nh&#7853;n m&#7853;t  kh&#7849;u.</li>
        </ul>
      </li>
      <li>Qu&#7843;n l&yacute; c&oacute; th&#7875; kh&ocirc;ng nh&#7853;p th&ocirc;ng tin nh&acirc;n vi&ecirc;n.</li>
    </ul>
  </li>
  <ul>
    <ul>
      <ul>
        <ul>
        </ul>
      </ul>
    </ul>
  </ul>
</ul>
<ul>
<ul>
  <li><strong>X&oacute;a  nh&acirc;n vi&ecirc;n:</strong></li>
</ul>
<ul>
  <ul>
    <ul>
      <li><strong>T&ecirc;n Use Case:</strong> X&oacute;a nh&acirc;n vi&ecirc;n.<strong></strong></li>
      <li><strong>T&aacute;c nh&acirc;n: </strong>Qu&#7843;n l&yacute;.<strong></strong></li>
      <li><strong>&#272;i&#7873;u ki&#7879;n ti&ecirc;n quy&#7871;t (Pre  &ndash; conditions):</strong> Qu&#7843;n l&yacute; ph&#7843;i &#273;&#432;&#7907;c h&#7879; th&#7889;ng nh&#7853;n di&#7879;n v&agrave; &#7911;y quy&#7873;n s&#7917; d&#7909;ng h&#7879; th&#7889;ng.<strong></strong></li>
      <li><strong>&#272;i&#7873;u ki&#7879;n ho&agrave;n th&agrave;nh (Post  &ndash; conditions): </strong>X&oacute;a th&agrave;nh c&ocirc;ng nh&acirc;n vi&ecirc;n.<strong></strong></li>
      <li><strong>D&ograve;ng s&#7921; ki&#7879;n ch&iacute;nh (Main  Flow):</strong>
        <ul>
          <li>Qu&#7843;n l&yacute; y&ecirc;u c&#7847;u ch&#7913;c n&#259;ng x&oacute;a nh&acirc;n vi&ecirc;n</li>
          <li>H&#7879; th&#7889;ng hi&#7875;n th&#7883; danh s&aacute;ch nh&acirc;n vi&ecirc;n c&oacute; trong h&#7879; th&#7889;ng.</li>
          <li>Qu&#7843;n l&yacute; ch&#7885;n nh&acirc;n vi&ecirc;n c&#7847;n x&oacute;a v&agrave; y&ecirc;u c&#7847;u h&#7879; th&#7889;ng th&#7921;c hi&#7879;n  x&oacute;a nh&acirc;n vi&ecirc;n &#273;&#432;&#7907;c ch&#7885;n.</li>
          <li>H&#7879; th&#7889;ng th&#7921;c hi&#7879;n x&oacute;a nh&acirc;n vi&ecirc;n &#273;&#432;&#7907;c ch&#7885;n.</li>
        </ul>
      </li>
    </ul>
  </ul>
</ul>
<ul>
  <li><strong>D&ograve;ng s&#7921; ki&#7879;n ph&#7909;  (Extension):</strong> </li>
</ul>
<ul>
<ul>
<ul>
<ul>
<ul>
<ul>
<ul>
  <ul>
    <li>N&#7871;u trong qu&aacute; tr&igrave;nh th&#7921;c hi&#7879;n h&#7879; th&#7889;ng b&#7883; d&#7915;ng b&#7845;t ng&#7901;:
      <ul>
        <li>Qu&#7843;n l&yacute; kh&#7903;i &#273;&#7897;ng l&#7841;i h&#7879;  th&#7889;ng.</li>
        <li>H&#7879; th&#7889;ng h&#7911;y c&aacute;c thao t&aacute;c  tr&#432;&#7899;c &#273;&oacute; v&agrave; tr&#7903; v&#7873; tr&#7841;ng th&aacute;i ho&#7841;t &#273;&#7897;ng b&igrave;nh th&#432;&#7901;ng.
          <ul>
            <li>N&#7871;u Qu&#7843;n l&yacute; ch&#7885;n nh&acirc;n vi&ecirc;n c&oacute; Quy&#7873;n l&agrave; Admin:
              <ul>
                <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Kh&ocirc;ng  th&#7875; x&oacute;a t&agrave;i kho&#7843;n Admin!&rdquo;.</li>
              </ul>
            </li>
          </ul>
        </li>
      </ul>
    </li>
    <ul>
      <ul>
        <ul>
          <ul>
          </ul>
        </ul>
      </ul>
    </ul>
  </ul>
</ul>
<p><strong><a name = "3.3.7">3.3.7.</a> Qu&#7843;n l&yacute; th&#7921;c &#273;&#417;n</strong></p>
<ul>
  <li><strong>Th&ecirc;m  th&#7921;c &#273;&#417;n:</strong>
    <ul>
      <li><strong>T&ecirc;n Use Case:</strong> Th&ecirc;m th&#7921;c &#273;&#417;n.</li>
      <li><strong>T&aacute;c nh&acirc;n: </strong>Qu&#7843;n l&yacute;.</li>
      <li><strong>&#272;i&#7873;u ki&#7879;n ti&ecirc;n quy&#7871;t (Pre  &ndash; conditions):</strong> Qu&#7843;n l&yacute; ph&#7843;i &#273;&#432;&#7907;c h&#7879; th&#7889;ng nh&#7853;n di&#7879;n v&agrave; &#7911;y quy&#7873;n s&#7917; d&#7909;ng h&#7879; th&#7889;ng.</li>
      <li><strong>&#272;i&#7873;u ki&#7879;n ho&agrave;n th&agrave;nh (Post  &ndash; conditions): </strong>Th&ecirc;m th&agrave;nh c&ocirc;ng th&#7921;c &#273;&#417;n.</li>
      <li><strong>D&ograve;ng s&#7921; ki&#7879;n ch&iacute;nh (Main  Flow):</strong>
        <ul>
          <li>Qu&#7843;n l&yacute; y&ecirc;u c&#7847;u ch&#7913;c n&#259;ng th&ecirc;m h&oacute;a &#273;&#417;n.</li>
          <li>H&#7879; th&#7889;ng y&ecirc;u c&#7847;u Qu&#7843;n l&yacute; nh&#7853;p th&ocirc;ng tin th&#7921;c &#273;&#417;n m&#7899;i.</li>
          <li>Qu&#7843;n l&yacute; nh&#7853;p th&ocirc;ng tin th&#7921;c &#273;&#417;n c&#7847;n th&ecirc;m v&agrave; y&ecirc;u c&#7847;u h&#7879; th&#7889;ng  ghi nh&#7853;n.</li>
          <li>H&#7879; th&#7889;ng ghi nh&#7853;n th&ocirc;ng tin th&#7921;c &#273;&#417;n v&agrave; th&ocirc;ng b&aacute;o k&#7871;t qu&#7843;.<strong></strong></li>
        </ul>
      </li>
    </ul>
  </li>
  <ul>
    <ul>
      <ul>
      </ul>
    </ul>
  
    <li><strong>D&ograve;ng s&#7921; ki&#7879;n ph&#7909;  (Extension):</strong>    
      <ul>
        <li>N&#7871;u trong qu&aacute; tr&igrave;nh th&#7921;c hi&#7879;n h&#7879; th&#7889;ng b&#7883; d&#7915;ng b&#7845;t ng&#7901;: 
          <ul>
            <li>Qu&#7843;n l&yacute; kh&#7903;i &#273;&#7897;ng l&#7841;i h&#7879;  th&#7889;ng.</li>
            <li>H&#7879; th&#7889;ng h&#7911;y c&aacute;c thao t&aacute;c  tr&#432;&#7899;c &#273;&oacute; v&agrave; tr&#7903; v&#7873; tr&#7841;ng th&aacute;i ho&#7841;t &#273;&#7897;ng b&igrave;nh th&#432;&#7901;ng.</li>
          </ul>
        </li>
        <li>N&#7871;u Qu&#7843;n l&yacute; kh&ocirc;ng nh&#7853;p T&ecirc;n th&#7921;c &#273;&#417;n: 
          <ul>
            <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Ch&#432;a  nh&#7853;p t&ecirc;n th&#7921;c &#273;&#417;n!&rdquo;.</li>
            <li>Qu&#7843;n l&yacute; nh&#7853;p T&ecirc;n th&#7921;c &#273;&#417;n.</li>
          </ul>
        </li>
        <li>N&#7871;u T&ecirc;n th&#7921;c &#273;&#417;n tr&ugrave;ng v&#7899;i T&ecirc;n th&#7921;c &#273;&#417;n &#273;&atilde; c&oacute; trong h&#7879; th&#7889;ng 
          <ul>
            <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Th&#7921;c  &#273;&#417;n n&agrave;y &#273;&atilde; c&oacute;!&rdquo;.</li>
          </ul>
        </li>
        <li>N&#7871;u Qu&#7843;n l&yacute; kh&ocirc;ng nh&#7853;p &#272;&#417;n gi&aacute;:
          <ul>
            <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Ch&#432;a  nh&#7853;p &#273;&#417;n gi&aacute;!&rdquo;.</li>
            <li>Qu&#7843;n l&yacute; nh&#7853;p &#272;&#417;n gi&aacute;.</li>
          </ul>
        </li>
        <li>N&#7871;u ki&#7875;u d&#7919; li&#7879;u &#272;&#417;n gi&aacute; kh&ocirc;ng ch&iacute;nh x&aacute;c:
          <ul>
            <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Ki&#7875;u  d&#7919; li&#7879;u nh&#7853;p &#273;&#417;n gi&aacute; kh&ocirc;ng ch&iacute;nh x&aacute;c! Vui l&ograve;ng nh&#7853;p l&#7841;i &#273;&#417;n gi&aacute;!&rdquo;.</li>
            <li>Qu&#7843;n l&yacute; nh&#7853;p l&#7841;i &#272;&#417;n gi&aacute;.</li>
          </ul>
        </li>
        <li>N&#7871;u Qu&#7843;n l&yacute; kh&ocirc;ng nh&#7853;p Ng&agrave;y &aacute;p d&#7909;ng gi&aacute;:
          <ul>
            <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Ch&#432;a  nh&#7853;p ng&agrave;y &aacute;p d&#7909;ng &#273;&#417;n gi&aacute;!&rdquo;.</li>
            <li>Qu&#7843;n l&yacute; nh&#7853;p Ng&agrave;y &aacute;p d&#7909;ng  &#273;&#417;n gi&aacute;.</li>
          </ul>
        </li>
        <li>N&#7871;u Qu&#7843;n l&yacute; kh&ocirc;ng nh&#7853;p &#272;&#417;n v&#7883; t&iacute;nh:
          <ul>
            <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Ch&#432;a  nh&#7853;p &#273;&#417;n v&#7883; t&iacute;nh!&rdquo;.</li>
            <li>Qu&#7843;n l&yacute; nh&#7853;p &#272;&#417;n v&#7883; t&iacute;nh.</li>
          </ul>
        </li>
        <li>Qu&#7843;n l&yacute; c&oacute; th&#7875; kh&ocirc;ng nh&#7853;p th&ocirc;ng tin th&#7921;c &#273;&#417;n.</li>
      </ul>
    </li>
  </ul>
  
  <li><strong>C&#7853;p nh&#7853;t th&ocirc;ng tin th&#7921;c  &#273;&#417;n:</strong>
    <ul>
      <li><strong>T&ecirc;n Use Case:</strong> C&#7853;p nh&#7853;t th&ocirc;ng tin th&#7921;c  &#273;&#417;n</li>
      <li><strong>T&aacute;c nh&acirc;n: </strong>Qu&#7843;n l&yacute;.</li>
      <li><strong>&#272;i&#7873;u ki&#7879;n ti&ecirc;n quy&#7871;t (Pre  &ndash; conditions):</strong> Qu&#7843;n l&yacute; ph&#7843;i &#273;&#432;&#7907;c h&#7879; th&#7889;ng nh&#7853;n di&#7879;n v&agrave; &#7911;y quy&#7873;n s&#7917; d&#7909;ng h&#7879; th&#7889;ng.</li>
      <li><strong>&#272;i&#7873;u ki&#7879;n ho&agrave;n th&agrave;nh (Post  &ndash; conditions): </strong>C&#7853;p nh&#7853;t th&agrave;nh c&ocirc;ng th&ocirc;ng tin th&#7921;c &#273;&#417;n.</li>
      <li><strong>D&ograve;ng s&#7921; ki&#7879;n ch&iacute;nh (Main  Flow):</strong>
        <ul>
          <li>Qu&#7843;n l&yacute; y&ecirc;u c&#7847;u ch&#7913;c n&#259;ng c&#7853;p nh&#7853;t th&ocirc;ng tin th&#7921;c &#273;&#417;n.</li>
          <li>H&#7879; th&#7889;ng hi&#7875;n th&#7883; danh s&aacute;ch lo&#7841;i th&#7921;c &#273;&#417;n, y&ecirc;u c&#7847;u Qu&#7843;n l&yacute;  ch&#7885;n lo&#7841;i th&#7921;c &#273;&#417;n ho&#7863;c nh&#7853;p t&ecirc;n th&#7921;c &#273;&#417;n tra c&#7913;u (m&#7909;c 3.3.3. Use case Tra c&#7913;u  th&#7921;c &#273;&#417;n) &#273;&#7875; ch&#7885;n th&#7921;c &#273;&#417;n c&#7847;n c&#7853;p nh&#7853;t.</li>
          <li>Qu&#7843;n l&yacute; ch&#7885;n th&#7921;c &#273;&#417;n c&#7847;n c&#7853;p nh&#7853;t.H&#7879; th&#7889;ng hi&#7875;n th&#7883; th&ocirc;ng tin th&#7921;c &#273;&#417;n &#273;&#432;&#7907;c ch&#7885;n.</li>
          <li>Qu&#7843;n l&yacute; nh&#7853;p th&ocirc;ng tin c&#7847;n c&#7853;p nh&#7853;t v&agrave; y&ecirc;u c&#7847;u h&#7879; th&#7889;ng ghi  nh&acirc;n.</li>
          <li>H&#7879; th&#7889;ng ghi nh&#7853;n th&ocirc;ng tin th&#7921;c &#273;&#417;n &#273;&#432;&#7907;c c&#7853;p nh&#7853;t v&agrave; th&ocirc;ng  b&aacute;o k&#7871;t qu&#7843;.</li>
        </ul>
      </li>
      <li><strong>D&ograve;ng s&#7921; ki&#7879;n ph&#7909;  (Extension):</strong>
        <ul>
          <li>N&#7871;u trong qu&aacute; tr&igrave;nh th&#7921;c hi&#7879;n h&#7879; th&#7889;ng b&#7883; d&#7915;ng b&#7845;t ng&#7901;.
            <ul>
              <li>Qu&#7843;n l&yacute; kh&#7903;i &#273;&#7897;ng l&#7841;i h&#7879; th&#7889;ng.</li>
              <li>H&#7879; th&#7889;ng h&#7911;y c&aacute;c thao t&aacute;c tr&#432;&#7899;c &#273;&oacute; v&agrave; tr&#7903; v&#7873; tr&#7841;ng th&aacute;i ho&#7841;t  &#273;&#7897;ng b&igrave;nh th&#432;&#7901;ng.</li>
            </ul>
          </li>
          <li>N&#7871;u Qu&#7843;n l&yacute; kh&ocirc;ng nh&#7853;p T&ecirc;n th&#7921;c &#273;&#417;n:
            <ul>
              <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Ch&#432;a  nh&#7853;p t&ecirc;n th&#7921;c &#273;&#417;n!&rdquo;.</li>
              <li>Qu&#7843;n l&yacute; nh&#7853;p T&ecirc;n th&#7921;c &#273;&#417;n.</li>
            </ul>
          </li>
          <li>N&#7871;u T&ecirc;n th&#7921;c &#273;&#417;n tr&ugrave;ng v&#7899;i T&ecirc;n th&#7921;c &#273;&#417;n &#273;&atilde; c&oacute; trong h&#7879; th&#7889;ng:
            <ul>
              <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;T&ecirc;n th&#7921;c &#273;&#417;n b&#7883; tr&ugrave;ng!&rdquo;.</li>
            </ul>
          </li>
          <li>N&#7871;u Qu&#7843;n l&yacute; kh&ocirc;ng nh&#7853;p &#272;&#417;n gi&aacute; ho&#7863;c ki&#7875;u d&#7919; li&#7879;u &#272;&#417;n gi&aacute;  kh&ocirc;ng &#273;&uacute;ng:
            <ul>
              <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Ch&#432;a nh&#7853;p &#273;&#417;n gi&aacute; ho&#7863;c ki&#7875;u d&#7919; li&#7879;u &#273;&#417;n  gi&aacute; kh&ocirc;ng &#273;&uacute;ng!&rdquo;.</li>
              <li>Qu&#7843;n l&yacute; nh&#7853;p &#272;&#417;n gi&aacute;.</li>
            </ul>
          </li>
          <li>N&#7871;u &#272;&#417;n gi&aacute; nh&#7887; h&#417;n 0:
            <ul>
              <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;&#272;&#417;n gi&aacute; ph&#7843;i l&#7899;n h&#417;n 0!&rdquo;.</li>
              <li>Qu&#7843;n l&yacute; nh&#7853;p &#272;&#417;n gi&aacute;.</li>
            </ul>
          </li>
          <li>N&#7871;u Qu&#7843;n l&yacute; kh&ocirc;ng nh&#7853;p Ng&agrave;y &aacute;p d&#7909;ng gi&aacute;:
            <ul>
              <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Ch&#432;a nh&#7853;p ng&agrave;y &aacute;p d&#7909;ng gi&aacute;!&rdquo;.</li>
              <li>Qu&#7843;n l&yacute; nh&#7853;p Ng&agrave;y &aacute;p d&#7909;ng gi&aacute;.</li>
            </ul>
          </li>
          <li>N&#7871;u Qu&#7843;n l&yacute; kh&ocirc;ng nh&#7853;p &#272;&#417;n v&#7883; t&iacute;nh:
            <ul>
              <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Ch&#432;a nh&#7853;p &#273;&#417;n v&#7883; t&iacute;nh!&rdquo;.</li>
              <li>Qu&#7843;n l&yacute; nh&#7853;p &#272;&#417;n v&#7883; t&iacute;nh. </li>
            </ul>
          </li>
        
          <li>Qu&#7843;n l&yacute; c&oacute; th&#7875; kh&ocirc;ng nh&#7853;p th&ocirc;ng tin th&#7921;c &#273;&#417;n.</li>
        </ul>
      </li>
    </ul>
  </li>
  <ul>
    <ul>
      <ul>
        <ul>
        </ul>
      </ul>
    </ul>
  </ul>

  <li><strong>X&oacute;a th&#7921;c &#273;&#417;n:</strong>
    <ul>
      <li><strong>T&ecirc;n Use Case:</strong> X&oacute;a th&#7921;c &#273;&#417;n</li>
      <li><strong>T&aacute;c nh&acirc;n: </strong>Qu&#7843;n l&yacute;.</li>
      <li><strong>&#272;i&#7873;u ki&#7879;n ti&ecirc;n quy&#7871;t (Pre  &ndash; conditions):</strong> Qu&#7843;n l&yacute; ph&#7843;i &#273;&#432;&#7907;c h&#7879; th&#7889;ng nh&#7853;n di&#7879;n v&agrave; &#7911;y quy&#7873;n s&#7917; d&#7909;ng h&#7879; th&#7889;ng.</li>
      <li><strong>&#272;i&#7873;u ki&#7879;n ho&agrave;n th&agrave;nh (Post  &ndash; conditions): </strong>X&oacute;a th&agrave;nh c&ocirc;ng th&#7921;c &#273;&#417;n.</li>
      <li><strong>D&ograve;ng s&#7921; ki&#7879;n ch&iacute;nh (Main  Flow):</strong>
        <ul>
          <li>Qu&#7843;n l&yacute; y&ecirc;u c&#7847;u ch&#7913;c n&#259;ng x&oacute;a th&#7921;c &#273;&#417;n.</li>
          <li>H&#7879; th&#7889;ng hi&#7875;n th&#7883; danh s&aacute;ch lo&#7841;i th&#7921;c &#273;&#417;n, y&ecirc;u c&#7847;u Qu&#7843;n l&yacute;  ch&#7885;n lo&#7841;i th&#7921;c &#273;&#417;n ho&#7863;c nh&#7853;p t&ecirc;n th&#7921;c &#273;&#417;n tra c&#7913;u (m&#7909;c 3.3.3. Use case Tra c&#7913;u  th&#7921;c &#273;&#417;n) &#273;&#7875; ch&#7885;n th&#7921;c &#273;&#417;n c&#7847;n x&oacute;a.</li>
          <li>Qu&#7843;n l&yacute; ch&#7885;n th&#7921;c &#273;&#417;n c&#7847;n x&oacute;a v&agrave; y&ecirc;u c&#7847;u h&#7879; th&#7889;ng th&#7921;c hi&#7879;n  x&oacute;a th&#7921;c &#273;&#417;n &#273;&atilde; ch&#7885;n.</li>
          <li>H&#7879; th&#7889;ng th&#7921;c hi&#7879;n x&oacute;a th&#7921;c &#273;&#417;n &#273;&#432;&#7907;c ch&#7885;n v&agrave; th&ocirc;ng b&aacute;o k&#7871;t  qu&#7843;.</li>
        </ul>
      </li>
      <li><strong>D&ograve;ng s&#7921; ki&#7879;n ph&#7909;  (Extension):</strong>
        <ul>
            <li>N&#7871;u trong qu&aacute; tr&igrave;nh th&#7921;c hi&#7879;n h&#7879; th&#7889;ng b&#7883; d&#7915;ng b&#7845;t ng&#7901;:
              <ul>
                <li>Qu&#7843;n l&yacute; kh&#7903;i &#273;&#7897;ng l&#7841;i h&#7879;  th&#7889;ng.</li>
                <li>H&#7879; th&#7889;ng h&#7911;y c&aacute;c thao t&aacute;c  tr&#432;&#7899;c &#273;&oacute; v&agrave; tr&#7903; v&#7873; tr&#7841;ng th&aacute;i ho&#7841;t &#273;&#7897;ng b&igrave;nh th&#432;&#7901;ng.</li>
              </ul>
          </li>
            <li>N&#7871;u Qu&#7843;n l&yacute; ch&#7885;n th&#7921;c &#273;&#417;n &#273;&atilde; c&oacute; trong danh s&aacute;ch g&#7885;i m&oacute;n ho&#7863;c  trong chi ti&#7871;t h&oacute;a &#273;&#417;n:
              <ul>
                <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Th&#7921;c  &#273;&#417;n &#273;&atilde; &#273;&#432;&#7907;c g&#7885;i m&oacute;n ho&#7863;c c&oacute; trong h&oacute;a &#273;&#417;n. Kh&ocirc;ng th&#7875; x&oacute;a!!!&rdquo;.</li>
              </ul>
            </li>
            <li>N&#7871;u Qu&#7843;n l&yacute; ch&#432;a ch&#7885;n th&#7921;c &#273;&#417;n:
              <ul>
                <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Ch&#432;a  ch&#7885;n th&#7921;c &#273;&#417;n c&#7847;n x&oacute;a!&rdquo;</li>
                <li>Qu&#7843;n l&yacute; ch&#7885;n th&#7921;c &#273;&#417;n mu&#7889;n  x&oacute;a.</li>
              </ul>
            </li>
        </ul>
      </li>
    </ul>
  </li>
</ul>
<p><strong><a name = "3.3.8">3.3.8.</a> Ph&acirc;n c&ocirc;ng nh&acirc;n vi&ecirc;n</strong></p>
<ul><ul>
  <li><strong>T&ecirc;n Use Case:</strong> Ph&acirc;n c&ocirc;ng nh&acirc;n vi&ecirc;n.</li>
    <li><strong>T&aacute;c nh&acirc;n: </strong>Qu&#7843;n l&yacute;.<strong></strong></li>
    <li><strong>&#272;i&#7873;u ki&#7879;n ti&ecirc;n quy&#7871;t (Pre  &ndash; conditions):</strong> Qu&#7843;n l&yacute; ph&#7843;i &#273;&#432;&#7907;c h&#7879; th&#7889;ng nh&#7853;n di&#7879;n v&agrave; &#7911;y quy&#7873;n s&#7917; d&#7909;ng h&#7879; th&#7889;ng.<strong></strong></li>
    <li><strong>&#272;i&#7873;u ki&#7879;n ho&agrave;n th&agrave;nh (Post  &ndash; conditions): </strong>Ph&acirc;n c&ocirc;ng th&agrave;nh c&ocirc;ng nh&acirc;n vi&ecirc;n.<strong></strong></li>
    <li><strong>D&ograve;ng s&#7921; ki&#7879;n ch&iacute;nh (Main  Flow):</strong>
      <ul>
        <li>Qu&#7843;n l&yacute; y&ecirc;u c&#7847;u ch&#7913;c n&#259;ng ph&acirc;n c&ocirc;ng nh&acirc;n vi&ecirc;n.</li>
        <li>H&#7879; th&#7889;ng hi&#7875;n th&#7883; danh s&aacute;ch nh&acirc;n vi&ecirc;n, b&agrave;n v&agrave; ca c&oacute; trong h&#7879;  th&#7889;ng.</li>
        <li>H&#7879; th&#7889;ng y&ecirc;u c&#7847;u Qu&#7843;n l&yacute; nh&#7853;p th&ocirc;ng tin ph&acirc;n c&ocirc;ng.</li>
        <li>Qu&#7843;n l&yacute; ch&#7885;n nh&acirc;n vi&ecirc;n, b&agrave;n, ca, nh&#7853;p ng&agrave;y ph&acirc;n c&ocirc;ng&nbsp; v&agrave; y&ecirc;u c&#7847;u h&#7879; th&#7889;ng ghi nh&#7853;n th&ocirc;ng tin ph&acirc;n  c&ocirc;ng.</li>
        <li>H&#7879; th&#7889;ng ghi nh&#7853;n th&ocirc;ng tin ph&acirc;n c&ocirc;ng v&agrave; th&ocirc;ng b&aacute;o k&#7871;t qu&#7843;.</li>
      </ul>
    </li>
    <li><strong>D&ograve;ng s&#7921; ki&#7879;n ph&#7909;  (Extension):</strong>    </li>
</ul>
</ul>
<ul>
  <ul>
      <ul>
        <li>N&#7871;u trong qu&aacute; tr&igrave;nh th&#7921;c hi&#7879;n h&#7879; th&#7889;ng b&#7883; d&#7915;ng b&#7845;t ng&#7901;:
          <ul>
            <li>Qu&#7843;n l&yacute; kh&#7903;i &#273;&#7897;ng l&#7841;i h&#7879;  th&#7889;ng.</li>
            <li>H&#7879; th&#7889;ng h&#7911;y c&aacute;c thao t&aacute;c  tr&#432;&#7899;c &#273;&oacute; v&agrave; tr&#7903; v&#7873; tr&#7841;ng th&aacute;i ho&#7841;t &#273;&#7897;ng b&igrave;nh th&#432;&#7901;ng.</li>
          </ul>
        </li>
        <li>N&#7871;u Qu&#7843;n l&yacute; kh&ocirc;ng nh&#7853;p Nh&acirc;n vi&ecirc;n ph&acirc;n c&ocirc;ng:
          <ul>
            <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Ch&#432;a  ch&#7885;n nh&acirc;n vi&ecirc;n!&rdquo;.</li>
            <li>Qu&#7843;n l&yacute; ch&#7885;n Nh&acirc;n vi&ecirc;n  mu&#7889;n ph&acirc;n c&ocirc;ng.</li>
          </ul>
        </li>
        <li>N&#7871;u Qu&#7843;n l&yacute; kh&ocirc;ng nh&#7853;p Ca ph&acirc;n c&ocirc;ng:
          <ul>
            <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Ch&#432;a  ch&#7885;n ca!&rdquo;.</li>
            <li>Qu&#7843;n l&yacute; ch&#7885;n Ca mu&#7889;n ph&acirc;n  c&ocirc;ng.</li>
          </ul>
        </li>
        <li>N&#7871;u Qu&#7843;n l&yacute; kh&ocirc;ng nh&#7853;p B&agrave;n ph&acirc;n c&ocirc;ng:
          <ul>
            <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Ch&#432;a  ch&#7885;n b&agrave;n!&rdquo;.</li>
            <li>Qu&#7843;n l&yacute; ch&#7885;n B&agrave;n mu&#7889;n ph&acirc;n  c&ocirc;ng.</li>
          </ul>
        </li>
        <li>N&#7871;u Qu&#7843;n l&yacute; kh&ocirc;ng nh&#7853;p Ng&agrave;y ph&acirc;n c&ocirc;ng:
          <ul>
            <li>H&#7879; th&#7889;ng th&ocirc;ng  b&aacute;o &ldquo;Ch&#432;a ch&#7885;n ng&agrave;y ph&acirc;n c&ocirc;ng!&rdquo;.</li>
            <li>Qu&#7843;n l&yacute; nh&#7853;p  Ng&agrave;y ph&acirc;n c&ocirc;ng.</li>
          </ul>
        </li>
        <li>N&#7871;u nh&#7919;ng th&ocirc;ng tin ph&acirc;n c&ocirc;ng Qu&#7843;n l&yacute; nh&#7853;p v&agrave;o tr&ugrave;ng v&#7899;i  th&ocirc;ng tin ph&acirc;n c&ocirc;ng c&oacute; trong h&#7879; th&#7889;ng:
          <ul>
            <li>H&#7879; th&#7889;ng th&ocirc;ng  b&aacute;o &ldquo;Ph&acirc;n c&ocirc;ng n&agrave;y &#273;&atilde; c&oacute; r&#7891;i!&rdquo;.</li>
          </ul>
        </li>
        <li>Qu&#7843;n l&yacute; c&oacute; th&#7875; kh&ocirc;ng nh&#7853;p th&ocirc;ng tin ph&acirc;n c&ocirc;ng.</li>
        <ul><ul>
        </ul>
        </ul>
    </ul>
  </ul>
</ul>
<p><strong><a name = "3.3.9">3.3.9.</a> Qu&#7843;n l&yacute; h&oacute;a &#273;&#417;n</strong></p>
<ul>
<ul>
  <li><strong>In  h&oacute;a &#273;&#417;n:</strong></li>
</ul>
<ul>
<ul>
<ul>
<ul>
  <li><strong>T&ecirc;n Use Case:</strong> In h&oacute;a &#273;&#417;n.<strong></strong></li>
  <li><strong>T&aacute;c nh&acirc;n: </strong>Qu&#7843;n l&yacute;.<strong></strong></li>
  <li><strong>&#272;i&#7873;u ki&#7879;n ti&ecirc;n quy&#7871;t (Pre  &ndash; conditions):</strong> Qu&#7843;n l&yacute; ph&#7843;i &#273;&#432;&#7907;c h&#7879; th&#7889;ng nh&#7853;n di&#7879;n v&agrave; &#7911;y quy&#7873;n s&#7917; d&#7909;ng h&#7879; th&#7889;ng.<strong></strong></li>
  <li><strong>&#272;i&#7873;u ki&#7879;n ho&agrave;n th&agrave;nh (Post  &ndash; conditions):</strong> In th&agrave;nh c&ocirc;ng h&oacute;a &#273;&#417;n.<strong></strong></li>
  <li><strong>D&ograve;ng s&#7921; ki&#7879;n ch&iacute;nh (Main  Flow):</strong></li>
</ul>
<ul>
  <ul>
    <li>Qu&#7843;n l&yacute; y&ecirc;u c&#7847;u ch&#7913;c n&#259;ng in h&oacute;a &#273;&#417;n.</li>
    <li>H&#7879; th&#7889;ng hi&#7875;n th&#7883; danh s&aacute;ch h&oacute;a &#273;&#417;n c&oacute; trong h&#7879; th&#7889;ng.
      <ul>
        <li>Qu&#7843;n l&yacute; ch&#7885;n h&oacute;a &#273;&#417;n c&#7847;n in v&agrave; y&ecirc;u c&#7847;u h&#7879; th&#7889;ng th&#7921;c hi&#7879;n in  h&oacute;a &#273;&#417;n &#273;&atilde; ch&#7885;n.</li>
        <li>H&#7879; th&#7889;ng th&#7921;c hi&#7879;n in h&oacute;a &#273;&#417;n &#273;&#432;&#7907;c ch&#7885;n.<strong></strong></li>
      </ul>
    </li>
    <ul>
      <ul>
      </ul>
    </ul>
  </ul>
  
  <li><strong>D&ograve;ng s&#7921; ki&#7879;n ph&#7909;  (Extension):</strong>
    <ul>
      <li>N&#7871;u trong qu&aacute; tr&igrave;nh th&#7921;c hi&#7879;n h&#7879; th&#7889;ng b&#7883; d&#7915;ng b&#7845;t ng&#7901;
        <ul>
          <li>Qu&#7843;n l&yacute; kh&#7903;i &#273;&#7897;ng l&#7841;i h&#7879;  th&#7889;ng.</li>
          <li>H&#7879; th&#7889;ng h&#7911;y c&aacute;c thao t&aacute;c  tr&#432;&#7899;c &#273;&oacute; v&agrave; tr&#7903; v&#7873; tr&#7841;ng th&aacute;i ho&#7841;t &#273;&#7897;ng b&igrave;nh th&#432;&#7901;ng.</li>
        </ul>
      </li>
      <li>N&#7871;u Qu&#7843;n l&yacute; ch&#432;a ch&#7885;n h&oacute;a &#273;&#417;n:
        <ul>
          <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Ch&#432;a  ch&#7885;n h&oacute;a &#273;&#417;n c&#7847;n in!&rdquo;.</li>
          <li>Qu&#7843;n l&yacute; ch&#7885;n h&oacute;a &#273;&#417;n c&#7847;n  in.</li>
        </ul>
      </li>
    </ul>
  </li>
  <ul>
    <ul>
      <ul>
        <ul>
          <ul>
          </ul>
        </ul>
      </ul>
    </ul>
  </ul>
</ul>
<ul>
  <li><strong>X&oacute;a h&oacute;a &#273;&#417;n:</strong>
    <ul>
      <li><strong>T&ecirc;n Use Case:</strong> X&oacute;a h&oacute;a &#273;&#417;n.</li>
      <li><strong>T&aacute;c nh&acirc;n: </strong>Qu&#7843;n l&yacute;.</li>
      <li><strong>&#272;i&#7873;u ki&#7879;n ti&ecirc;n quy&#7871;t (Pre  &ndash; conditions):</strong> Qu&#7843;n l&yacute; ph&#7843;i &#273;&#432;&#7907;c h&#7879; th&#7889;ng nh&#7853;n di&#7879;n v&agrave; &#7911;y quy&#7873;n s&#7917; d&#7909;ng h&#7879; th&#7889;ng.</li>
      <li><strong>&#272;i&#7873;u ki&#7879;n ho&agrave;n th&agrave;nh (Post  &ndash; conditions): </strong>X&oacute;a th&agrave;nh c&ocirc;ng h&oacute;a &#273;&#417;n.</li>
      <li><strong>D&ograve;ng s&#7921; ki&#7879;n ch&iacute;nh (Main  Flow):</strong>
        <ul>
          <li>Qu&#7843;n l&yacute; y&ecirc;u c&#7847;u ch&#7913;c n&#259;ng x&oacute;a h&oacute;a &#273;&#417;n.</li>
          <li>H&#7879; th&#7889;ng hi&#7875;n th&#7883; danh s&aacute;ch h&oacute;a &#273;&#417;n c&oacute; trong h&#7879; th&#7889;ng.</li>
          <li>Qu&#7843;n l&yacute; ch&#7885;n h&oacute;a &#273;&#417;n mu&#7889;n x&oacute;a v&agrave; y&ecirc;u c&#7847;u h&#7879; th&#7889;ng th&#7921;c hi&#7879;n  x&oacute;a h&oacute;a &#273;&#417;n &#273;&atilde; ch&#7885;n.</li>
          <li>H&#7879; th&#7889;ng th&#7921;c hi&#7879;n x&oacute;a h&oacute;a &#273;&#417;n &#273;&#432;&#7907;c ch&#7885;n v&agrave; th&ocirc;ng b&aacute;o k&#7871;t  qu&#7843;.<strong></strong></li>
        </ul>
      </li>
    </ul>
  </li>
  <ul>
    <ul>
      <ul>
      </ul>
    </ul>
  </ul>
  <li><strong>D&ograve;ng s&#7921; ki&#7879;n ph&#7909;  (Extension):</strong>
    <ul>
      <li>N&#7871;u trong qu&aacute; tr&igrave;nh th&#7921;c hi&#7879;n h&#7879; th&#7889;ng b&#7883; d&#7915;ng b&#7845;t ng&#7901;: 
        <ul>
          <li>Qu&#7843;n l&yacute; kh&#7903;i &#273;&#7897;ng l&#7841;i h&#7879;  th&#7889;ng</li>
          <li>H&#7879; th&#7889;ng h&#7911;y c&aacute;c thao t&aacute;c  tr&#432;&#7899;c &#273;&oacute; v&agrave; tr&#7903; v&#7873; tr&#7841;ng th&aacute;i ho&#7841;t &#273;&#7897;ng b&igrave;nh th&#432;&#7901;ng.</li>
        </ul>
      </li>
    </ul>
  </li>
  <ul>
    <ul>
      <ul>
        <ul>
          <ul>
          </ul>
        </ul>
      </ul>
    </ul>
    <li>N&#7871;u kh&ocirc;ng c&oacute; h&oacute;a &#273;&#417;n n&agrave;o trong h&#7879; th&#7889;ng:</li>
    <li>H&#7879; th&#7889;ng th&ocirc;ng b&aacute;o &ldquo;Kh&ocirc;ng  c&oacute; h&oacute;a &#273;&#417;n thanh to&aacute;n n&agrave;o trong h&#7879; th&#7889;ng!&rdquo;.</li>
  </ul>
</ul>
<p><strong><A NAME = "3.4">3.4.</A> S&#417; &#273;&#7891; l&#7899;p</strong></p>
<p align="center"><img src="Images/FIG03-02.jpg" width="675" height="487" /></p>
<p align="center">H&igrave;nh  3.2.S&#417; &#273;&#7891; l&#7899;p</p>
<p><strong><A NAME = "3.5">3.5.</A> M&ocirc; t&#7843;  c&aacute;c l&#7899;p trong s&#417; &#273;&#7891; l&#7899;p</strong><br />
  <strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <a name = "3.5.1">3.5.1.</a> L&#7899;p  NhanVien</strong></p>
<table border="1" cellspacing="0" cellpadding="0">
  <tr>
    <td width="60"><br />
        <strong>STT</strong> </td>
    <td width="144"><p align="center"><strong>Thu&#7897;c t&iacute;nh</strong></p></td>
    <td width="396"><p align="center"><strong>M&ocirc; t&#7843;</strong></p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>1</p></td>
    <td width="144" valign="top"><p>MaNV</p></td>
    <td width="396" valign="top"><p>M&atilde; s&#7889; nh&acirc;n vi&ecirc;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>2</p></td>
    <td width="144" valign="top"><p>HoTen</p></td>
    <td width="396" valign="top"><p>H&#7885; t&ecirc;n nh&acirc;n vi&ecirc;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>3</p></td>
    <td width="144" valign="top"><p>NgaySinh</p></td>
    <td width="396" valign="top"><p>Ng&agrave;y sinh c&#7911;a nh&acirc;n vi&ecirc;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>4</p></td>
    <td width="144" valign="top"><p>TenDN</p></td>
    <td width="396" valign="top"><p>T&ecirc;n t&agrave;i kho&#7843;n &#273;&#259;ng nh&#7853;p ch&#432;&#417;ng    tr&igrave;nh c&#7911;a nh&acirc;n vi&ecirc;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>5</p></td>
    <td width="144" valign="top"><p>MatKhau</p></td>
    <td width="396" valign="top"><p>M&#7853;t kh&#7849;u &#273;&#259;ng nh&#7853;p ch&#432;&#417;ng tr&igrave;nh c&#7911;a    nh&acirc;n vi&ecirc;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>6</p></td>
    <td width="144" valign="top"><p>Quyen</p></td>
    <td width="396" valign="top"><p>Quy&#7873;n c&#7911;a nh&acirc;n vi&ecirc;n &#273;&#7889;i v&#7899;i h&#7879;    th&#7889;ng ch&#432;&#417;ng tr&igrave;nh</p></td>
  </tr>
</table>
<p><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </strong><br />
    <strong><a name = "3.5.2">3.5.2</a>. L&#7899;p BanAn</strong></p>
<table border="1" cellspacing="0" cellpadding="0">
  <tr>
    <td width="60"><br />
        <strong>STT</strong> </td>
    <td width="144"><p align="center"><strong>Thu&#7897;c t&iacute;nh</strong></p></td>
    <td width="396"><p align="center"><strong>M&ocirc; t&#7843;</strong></p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>1</p></td>
    <td width="144" valign="top"><p>MaSoBan</p></td>
    <td width="396" valign="top"><p>M&atilde; s&#7889; b&agrave;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>2</p></td>
    <td width="144" valign="top"><p>SoGhe</p></td>
    <td width="396" valign="top"><p>S&#7889; gh&#7871;</p></td>
  </tr>
</table>
<p><strong><a name = "3.5.3">3.5.3.</a> L&#7899;p PhanCong</strong></p>
<table border="1" cellspacing="0" cellpadding="0">
  <tr>
    <td width="60"><br />
        <strong>STT</strong> </td>
    <td width="144"><p align="center"><strong>Thu&#7897;c t&iacute;nh</strong></p></td>
    <td width="396"><p align="center"><strong>M&ocirc; t&#7843;</strong></p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>1</p></td>
    <td width="144" valign="top"><p>NgayPC</p></td>
    <td width="396" valign="top"><p>Ng&agrave;y &#273;&#432;&#7907;c ph&acirc;n c&ocirc;ng</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>2</p></td>
    <td width="144" valign="top"><p>Ca</p></td>
    <td width="396" valign="top"><p>Ca trong ng&agrave;y (g&#7891;m 3 ca: 1, 2, 3)</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>3</p></td>
    <td width="144" valign="top"><p>MaNV</p></td>
    <td width="396" valign="top"><p>M&atilde; s&#7889; nh&acirc;n vi&ecirc;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>4</p></td>
    <td width="144" valign="top"><p>MaSoBan</p></td>
    <td width="396" valign="top"><p>M&atilde; s&#7889; b&agrave;n</p></td>
  </tr>
</table>
<p><strong><a name = "3.5.4">3.5.4</a>. L&#7899;p LoaiThucDon</strong></p>
<table border="1" cellspacing="0" cellpadding="0">
  <tr>
    <td width="60"><br />
        <strong>STT</strong> </td>
    <td width="144"><p align="center"><strong>Thu&#7897;c t&iacute;nh</strong></p></td>
    <td width="396"><p align="center"><strong>M&ocirc; t&#7843;</strong></p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>1</p></td>
    <td width="144" valign="top"><p>MaLoai</p></td>
    <td width="396" valign="top"><p>M&atilde; lo&#7841;i th&#7921;c &#273;&#417;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>2</p></td>
    <td width="144" valign="top"><p>Nhom</p></td>
    <td width="396" valign="top"><p>Nh&oacute;m th&#7921;c &#273;&#417;n (g&#7891;m 2 nh&oacute;m: th&#7913;c &#259;n    v&agrave; n&#432;&#7899;c u&#7889;ng)</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>3</p></td>
    <td width="144" valign="top"><p>TenLoai</p></td>
    <td width="396" valign="top"><p>T&ecirc;n lo&#7841;i th&#7921;c &#273;&#417;n</p></td>
  </tr>
</table>
<strong><br clear="all" />
</strong>
<p><strong><a name = "3.5.5">3.5.5.</a> L&#7899;p ThucDon</strong></p>
<table border="1" cellspacing="0" cellpadding="0">
  <tr>
    <td width="60"><br />
        <strong>STT</strong> </td>
    <td width="144"><p align="center"><strong>Thu&#7897;c t&iacute;nh</strong></p></td>
    <td width="396"><p align="center"><strong>M&ocirc; t&#7843;</strong></p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>1</p></td>
    <td width="144" valign="top"><p>MaThucDon</p></td>
    <td width="396" valign="top"><p>M&atilde; th&#7921;c &#273;&#417;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>2</p></td>
    <td width="144" valign="top"><p>MaLoai</p></td>
    <td width="396" valign="top"><p>M&atilde; lo&#7841;i th&#7921;c &#273;&#417;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>3</p></td>
    <td width="144" valign="top"><p>TenThucDon</p></td>
    <td width="396" valign="top"><p>T&ecirc;n th&#7921;c &#273;&#417;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>4</p></td>
    <td width="144" valign="top"><p>DonViTinh</p></td>
    <td width="396" valign="top"><p>&#272;&#417;n v&#7883; t&iacute;nh c&#7911;a th&#7921;c &#273;&#417;n</p></td>
  </tr>
</table>
<p><strong><a name = "3.5.6">3.5.6. L&#7899;p Gia</a></strong></p>
<table border="1" cellspacing="0" cellpadding="0">
  <tr>
    <td width="60"><br />
        <strong>STT</strong> </td>
    <td width="144"><p align="center"><strong>Thu&#7897;c t&iacute;nh</strong></p></td>
    <td width="396"><p align="center"><strong>M&ocirc; t&#7843;</strong></p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>1</p></td>
    <td width="144" valign="top"><p>NgayADGia</p></td>
    <td width="396" valign="top"><p>Ng&agrave;y &aacute;p d&#7909;ng gi&aacute;</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>2</p></td>
    <td width="144" valign="top"><p>MaThucDon</p></td>
    <td width="396" valign="top"><p>M&atilde; th&#7921;c &#273;&#417;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>3</p></td>
    <td width="144" valign="top"><p>Gia</p></td>
    <td width="396" valign="top"><p>Gi&aacute; c&#7911;a th&#7921;c &#273;&#417;n</p></td>
  </tr>
</table>
<p><strong><a name = "3.5.7">3.5.7.</a> L&#7899;p HoaDon</strong></p>
<table border="1" cellspacing="0" cellpadding="0">
  <tr>
    <td width="60"><br />
        <strong>STT</strong> </td>
    <td width="144"><p align="center"><strong>Thu&#7897;c t&iacute;nh</strong></p></td>
    <td width="396"><p align="center"><strong>M&ocirc; t&#7843;</strong></p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>1</p></td>
    <td width="144" valign="top"><p>SoHD</p></td>
    <td width="396" valign="top"><p>S&#7889; h&oacute;a &#273;&#417;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>2</p></td>
    <td width="144" valign="top"><p>ThoiGianLap</p></td>
    <td width="396" valign="top"><p>Th&#7901;i gian l&#7853;p h&oacute;a &#273;&#417;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>3</p></td>
    <td width="144" valign="top"><p>MaSoBan</p></td>
    <td width="396" valign="top"><p>M&atilde; s&#7889; b&agrave;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>4</p></td>
    <td width="144" valign="top"><p>SoKhach</p></td>
    <td width="396" valign="top"><p>S&#7889; kh&aacute;ch</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>5</p></td>
    <td width="144" valign="top"><p>MaNVLap</p></td>
    <td width="396" valign="top"><p>M&atilde; nh&acirc;n vi&ecirc;n l&#7853;p h&oacute;a &#273;&#417;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>6</p></td>
    <td width="144" valign="top"><p>MaNVTT</p></td>
    <td width="396" valign="top"><p>M&atilde; nh&acirc;n vi&ecirc;n ti&#7871;p t&acirc;n b&agrave;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>7</p></td>
    <td width="144" valign="top"><p>TongTien</p></td>
    <td width="396" valign="top"><p>T&#7893;ng ti&#7873;n h&oacute;a &#273;&#417;n</p></td>
  </tr>
</table>
<p><strong><a name = "3.5.8">3.5.8.</a>L&#7899;p ChiTietHD</strong></p>
<table border="1" cellspacing="0" cellpadding="0">
  <tr>
    <td width="60"><br />
        <strong>STT</strong> </td>
    <td width="144"><p align="center"><strong>Thu&#7897;c t&iacute;nh</strong></p></td>
    <td width="396"><p align="center"><strong>M&ocirc; t&#7843;</strong></p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>1</p></td>
    <td width="144" valign="top"><p>SoHD</p></td>
    <td width="396" valign="top"><p>S&#7889; h&oacute;a &#273;&#417;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>2</p></td>
    <td width="144" valign="top"><p>MaThucDon</p></td>
    <td width="396" valign="top"><p>M&atilde; th&#7921;c &#273;&#417;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>3</p></td>
    <td width="144" valign="top"><p>SoLuong</p></td>
    <td width="396" valign="top"><p>S&#7889; l&#432;&#7907;ng c&#7911;a th&#7921;c &#273;&#417;n</p></td>
  </tr>
  <tr>
    <td width="60" valign="top"><p>4</p></td>
    <td width="144" valign="top"><p>DonGia</p></td>
    <td width="396" valign="top"><p>&#272;&#417;n gi&aacute; c&#7911;a th&#7921;c &#273;&#417;n</p></td>
  </tr>
</table>
<p>&nbsp;</p>
<p>&nbsp;</p>
</body>
</html>
