<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
</head>

<body>
<p align="center"><strong>T&Agrave;I LI&#7878;U THAM KH&#7842;O</strong></p>
<p><a href="http://msdn.microsoft.com/">http://msdn.microsoft.com</a><br />
  <a href="http://dot.net.vn/">http://dot.net.vn</a></p>
<p align="center"><strong>K&#7870;T LU&#7852;N</strong></p>
<p align="left"><br />
  Ch&uacute;ng em xin  g&#7903;i &#273;&#7871;n t&#7845;t c&#7843; c&aacute;c Th&#7847;y C&ocirc;, c&aacute;c b&#7841;n &ndash; nh&#7919;ng ng&#432;&#7901;i &#273;&atilde; t&#7853;n t&igrave;nh gi&uacute;p &#273;&#7905; ch&uacute;ng em  trong su&#7889;t th&#7901;i gian l&agrave;m &#273;&#7873; t&agrave;i v&#7873; m&#7863;t chuy&ecirc;n m&ocirc;n c&#361;ng nh&#432; s&#7921; gi&uacute;p &#273;&#7905; v&#7873; m&#7863;t  tinh th&#7847;n l&#7901;i c&#7843;m &#417;n s&acirc;u s&#7855;c.<br />
&#272;&#7875; ho&agrave;n th&agrave;nh  &#273;&#7873; t&agrave;i n&agrave;y, ch&uacute;ng em &#273;&atilde; nh&#7853;n &#273;&#432;&#7907;c nhi&#7873;u s&#7921; g&oacute;p &yacute; t&#7915; ph&iacute;a th&#7847;y c&ocirc;, &#273;&#7863;c bi&#7879;t l&agrave;  th&#7847;y Nguy&#7877;n Xu&acirc;n C&#432;&#7901;ng &#273;&atilde; lu&ocirc;n h&#7895; tr&#7907; m&#7895;i khi &#273;&#7873; t&agrave;i g&#7863;p kh&oacute; kh&#259;n, b&ecirc;n c&#7841;nh &#273;&oacute;  ch&uacute;ng em c&ograve;n h&#7885;c &#273;&#432;&#7907;c c&aacute;ch l&agrave;m vi&#7879;c theo nh&oacute;m, c&aacute;ch t&#432;&#417;ng tr&#7907; l&#7851;n nhau m&#7895;i khi  g&#7863;p v&#7845;n &#273;&#7873; m&agrave; c&aacute; nh&acirc;n kh&ocirc;ng gi&#7843;i quy&#7871;t &#273;&#432;&#7907;c, ch&uacute;ng em c&#361;ng nh&#7853;n &#273;&#432;&#7907;c kh&ocirc;ng &iacute;t  s&#7921; gi&uacute;p &#273;&#7905; t&#7915; c&aacute;c b&#7841;n c&ugrave;ng l&#7899;p 07CTH01. Xin ch&acirc;n th&agrave;nh ghi nh&#7853;n t&#7845;t c&#7843; s&#7921; gi&uacute;p  &#273;&#7905; n&agrave;y v&agrave; cho ch&uacute;ng em g&#7903;i &#273;&#7871;n&nbsp; m&#7885;i ng&#432;&#7901;i  l&ograve;ng bi&#7871;t &#417;n s&acirc;u s&#7855;c nh&#7845;t.<br />
Tuy &#273;&atilde; c&oacute; r&#7845;t  nhi&#7873;u c&#7889; g&#7855;ng nh&#432;ng ch&#7855;c ch&#7855;n &#273;&#7873; t&agrave;i c&#7911;a ch&uacute;ng em kh&ocirc;ng tr&aacute;nh kh&#7887;i nh&#7919;ng thi&#7871;u  s&oacute;t, xin nh&#7853;n c&aacute;c g&oacute;p &yacute; t&#7915; ph&iacute;a c&aacute;c th&#7847;y c&ocirc; v&agrave; c&aacute;c b&#7841;n c&#361;ng nh&#432; s&#7921; th&ocirc;ng c&#7843;m &#273;&#7875;  ch&#432;&#417;ng tr&igrave;nh c&#7911;a ch&uacute;ng em ng&agrave;y c&agrave;ng ho&agrave;n thi&#7879;n h&#417;n.<br />
M&#7897;t l&#7847;n n&#7919;a  ch&uacute;ng em xin ch&acirc;n th&agrave;nh c&#7843;m &#417;n.<br />
Nh&oacute;m sinh vi&ecirc;n th&#7921;c hi&#7879;n:<br />
Nguy&#7877;n Xu&acirc;n Th&#7913;c<br />
V&otilde; Nh&#7853;t T&agrave;i</p>
</body>
</html>
